Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31032.PIC
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="DEVCFG0" edc:nzwidth="0x20" edc:impl="0x777603D6" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0x7100000b" edc:access="-nnn-nnn-nnn-nn-------nnnn-n-nn-" edc:_addr="0x805F98" edc:default="0x7100000b">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="SWOEN" edc:nzwidth="0x1" edc:desc="SWO enable on 2-wire debug interface">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="TROEN" edc:nzwidth="0x1" edc:desc="Trace Output Enable">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="ADCPOVR" edc:nzwidth="0x1" edc:desc="ADC Charge Pump Override">
              <edc:DCRFieldSemantic edc:cname="HW" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="SW" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="ACCMP1_ALTEN" edc:nzwidth="0x1" edc:desc="AC CMP1 Alternate Enable">
              <edc:DCRFieldSemantic edc:cname="PA6" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="PA13" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CPENFILT" edc:nzwidth="0x1" edc:desc="ADC CP Filter Enable">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RTCIN0_ALTEN" edc:nzwidth="0x1" edc:desc="RTCIN0 Alternate Enable">
              <edc:DCRFieldSemantic edc:cname="PA3" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="PA9" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RTCOUT_ALTEN" edc:nzwidth="0x1" edc:desc="RTCOUT Alternate Enable">
              <edc:DCRFieldSemantic edc:cname="PA4" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="PA10" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:DCRFieldDef edc:cname="SMBUSEN0" edc:nzwidth="0x1" edc:desc="SMBus Enable for SERCOM0">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SMBUSEN1" edc:nzwidth="0x1" edc:desc="SMBus Enable for SERCOM1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="HPLUGDIS" edc:nzwidth="0x1" edc:desc="Hot Plugging Disable">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SLRTEN0" edc:nzwidth="0x1" edc:desc="SLRT Enable for SERCOM0">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SLRTEN1" edc:nzwidth="0x1" edc:desc="SLRT Enable for SERCOM1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="PCM" edc:nzwidth="0x1" edc:desc="PCHE I/D Cacheable Mode">
              <edc:DCRFieldSemantic edc:cname="CPU" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="SFR" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="INT0E" edc:nzwidth="0x1" edc:desc="INT0 Enable">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="INT0P" edc:nzwidth="0x1" edc:desc="INT0P Polarity">
              <edc:DCRFieldSemantic edc:cname="NEG" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="POS" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="FECCCON" edc:nzwidth="0x2" edc:desc="Flash ECC Control">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="DYNAMIC" edc:desc="" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FRECCDIS" edc:nzwidth="0x1" edc:desc="Flex RAM ECC Control">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="FBCFG0" edc:nzwidth="0x20" edc:impl="0x80000002" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0x00000002" edc:access="n-----------------------------n-" edc:_addr="0x805F9C" edc:default="0x00000002">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="PCSCMODE" edc:nzwidth="0x1" edc:desc="PCache Single cache Mode">
              <edc:DCRFieldSemantic edc:cname="SINGLE" edc:desc="PCHE ICache Only.CPU Instructions (code, data) go to PCHE ONLY." edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="DUAL" edc:desc="PCHE ICache and DCache. CPU opcodes go to PCEHE ICache port and data goes to PCHE" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1D"/>
            <edc:DCRFieldDef edc:cname="BINFOVALID" edc:nzwidth="0x1" edc:desc="BCFG info valid">
              <edc:DCRFieldSemantic edc:cname="NOT_VALID" edc:desc="BCFG0 to BCFG7 is not valid." edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="VALID" edc:desc="BCFG0 to BCFG7 is valid." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:AdjustPoint edc:unimplval="0x0" edc:offset="0x10" edc:_addr="0x805FA0"/>
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="FCPN3" edc:nzwidth="0x20" edc:impl="0xFFFFFFFF" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x805FB0" edc:default="0xFFFFFFFF">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="FCPN3" edc:nzwidth="0x20" edc:desc="RESERVED"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="FCPN2" edc:nzwidth="0x20" edc:impl="0xFFFFFFFF" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x805FB4" edc:default="0xFFFFFFFF">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="FCPN2" edc:nzwidth="0x20" edc:desc="RESERVED"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="FCPN1" edc:nzwidth="0x20" edc:impl="0xFFFFFFFF" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x805FB8" edc:default="0xFFFFFFFF">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="FCPN1" edc:nzwidth="0x20" edc:desc="RESERVED"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="FCPN0" edc:nzwidth="0x20" edc:impl="0x10000000" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0x10000000" edc:access="---n----------------------------" edc:_addr="0x805FBC" edc:default="0x10000000">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:AdjustPoint edc:offset="0x1C"/>
            <edc:DCRFieldDef edc:cname="CP" edc:nzwidth="0x1" edc:desc="Boot Code Protect">
              <edc:DCRFieldSemantic edc:cname="DISABLED" edc:desc="Protection Disabled" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="ENABLED" edc:desc="Protection Enabled" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:BootConfigSector edc:regionid="FCR_OTP_PAGE" edc:beginaddr="0x806000" edc:endaddr="0x807000" atdf:pagesize="0x1000" edc:isotp="true" edc:rw="r"/>
    <edc:GPRDataSector edc:regionid="CMCC_TCM" edc:beginaddr="0x2000000" edc:endaddr="0x2001000" edc:rw="rw"/>
    <edc:GPRDataSector edc:regionid="RAM_SYSTEM_RAM" edc:beginaddr="0x20000000" edc:endaddr="0x20018000" edc:isexecutable="true" edc:rw="rw"/>
    <edc:ExternalSector edc:regionid="QSPI" edc:beginaddr="0x4000000" edc:endaddr="0x5000000" edc:isexecutable="true" edc:rw="rw" edc:accessprotocol="qspi" edc:type="flash"/>
    <edc:SFRDataSector edc:regionid="PBA_BRIDGE" edc:beginaddr="0x40000000" edc:endaddr="0x40003C88" edc:rw="rw">
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="WRCTRL" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x40000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PERID" edc:nzwidth="0x10" edc:desc="Peripheral identifier"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Peripheral access control key">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="No action" edc:when="(field &amp; 0xFF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CLR" edc:desc="Clear protection" edc:when="(field &amp; 0xFF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="Set protection" edc:when="(field &amp; 0xFF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SETLCK" edc:desc="Set and lock protection" edc:when="(field &amp; 0xFF) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="EVCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40000004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="ERREO" edc:nzwidth="0x1" edc:desc="Peripheral acess error event output"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x40000005"/>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="INTENCLR" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40000008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="ERR" edc:nzwidth="0x1" edc:desc="Peripheral access error interrupt disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="INTENSET" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40000009">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="ERR" edc:nzwidth="0x1" edc:desc="Peripheral access error interrupt enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x6" edc:_addr="0x4000000A"/>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="INTFLAGAHB" edc:nzwidth="0x20" edc:access="-------------------nnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1FFF" edc:_addr="0x40000010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="SRAM0_" edc:nzwidth="0x1" edc:desc="SRAM0"/>
            <edc:SFRFieldDef edc:cname="SRAM1_" edc:nzwidth="0x1" edc:desc="SRAM1"/>
            <edc:SFRFieldDef edc:cname="SRAM2_" edc:nzwidth="0x1" edc:desc="SRAM2"/>
            <edc:SFRFieldDef edc:cname="SRAM3_" edc:nzwidth="0x1" edc:desc="SRAM3"/>
            <edc:SFRFieldDef edc:cname="CFLASH_" edc:nzwidth="0x1" edc:desc="CFLASH"/>
            <edc:SFRFieldDef edc:cname="PFLASH_" edc:nzwidth="0x1" edc:desc="PFLASH"/>
            <edc:SFRFieldDef edc:cname="HPBA_" edc:nzwidth="0x1" edc:desc="HPBA"/>
            <edc:SFRFieldDef edc:cname="HPBB_" edc:nzwidth="0x1" edc:desc="HPBB"/>
            <edc:SFRFieldDef edc:cname="HPBC_" edc:nzwidth="0x1" edc:desc="HPBC"/>
            <edc:SFRFieldDef edc:cname="HPBPIC_" edc:nzwidth="0x1" edc:desc="HPBPIC0"/>
            <edc:SFRFieldDef edc:cname="QSPI_" edc:nzwidth="0x1" edc:desc="QSPI"/>
            <edc:SFRFieldDef edc:cname="ROT_" edc:nzwidth="0x1" edc:desc="ROT"/>
            <edc:SFRFieldDef edc:cname="CRYPTO_" edc:nzwidth="0x1" edc:desc="CRYPTO"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="INTFLAGA" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x40000014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PAC_" edc:nzwidth="0x1" edc:desc="PAC"/>
            <edc:SFRFieldDef edc:cname="FREQM_" edc:nzwidth="0x1" edc:desc="FREQM"/>
            <edc:SFRFieldDef edc:cname="EIC_" edc:nzwidth="0x1" edc:desc="EIC"/>
            <edc:SFRFieldDef edc:cname="SERCOM0_" edc:nzwidth="0x1" edc:desc="SERCOM0"/>
            <edc:SFRFieldDef edc:cname="SERCOM1_" edc:nzwidth="0x1" edc:desc="SERCOM1"/>
            <edc:SFRFieldDef edc:cname="TC0_" edc:nzwidth="0x1" edc:desc="TC0"/>
            <edc:SFRFieldDef edc:cname="TC1_" edc:nzwidth="0x1" edc:desc="TC1"/>
            <edc:SFRFieldDef edc:cname="TC2_" edc:nzwidth="0x1" edc:desc="TC2"/>
            <edc:SFRFieldDef edc:cname="TC3_" edc:nzwidth="0x1" edc:desc="TC3"/>
            <edc:SFRFieldDef edc:cname="TC4_" edc:nzwidth="0x1" edc:desc="TC4"/>
            <edc:SFRFieldDef edc:cname="TC5_" edc:nzwidth="0x1" edc:desc="TC5"/>
            <edc:SFRFieldDef edc:cname="TC6_" edc:nzwidth="0x1" edc:desc="TC6"/>
            <edc:SFRFieldDef edc:cname="TC7_" edc:nzwidth="0x1" edc:desc="TC7"/>
            <edc:SFRFieldDef edc:cname="TCC0_" edc:nzwidth="0x1" edc:desc="TCC0"/>
            <edc:SFRFieldDef edc:cname="TCC1_" edc:nzwidth="0x1" edc:desc="TCC1"/>
            <edc:SFRFieldDef edc:cname="TCC2_" edc:nzwidth="0x1" edc:desc="TCC2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
