Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31032.PIC
      <edc:SFRDef ltx:memberofperipheral="CMCC" edc:cname="MCFG" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3" edc:_addr="0x41002028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:SFRFieldDef edc:cname="MODE" edc:nzwidth="0x2" edc:desc="Cache Controller Monitor Counter Mode">
              <edc:SFRFieldSemantic edc:cname="CYCLE_COUNT" edc:desc="Cycle counter" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="IHIT_COUNT" edc:desc="Instruction hit counter" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DHIT_COUNT" edc:desc="Data hit counter" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CMCC" edc:cname="MEN" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1" edc:_addr="0x4100202C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:SFRFieldDef edc:cname="MENABLE" edc:nzwidth="0x1" edc:desc="Cache Controller Monitor Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CMCC" edc:cname="MCTRL" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1" edc:_addr="0x41002030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Cache Controller Software Reset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CMCC" edc:cname="MSR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41002034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC">
            <edc:SFRFieldDef edc:cname="EVENT_CNT" edc:nzwidth="0x20" edc:desc="Monitor Event Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1FC8" edc:_addr="0x41002038"/>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CTRL" edc:nzwidth="0x10" edc:access="----nnnn------nn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xF03" edc:_addr="0x41004000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="DMAENABLE" edc:nzwidth="0x1" edc:desc="DMA Enable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="LVLEN0" edc:nzwidth="0x1" edc:desc="Priority Level 0 Enable"/>
            <edc:SFRFieldDef edc:cname="LVLEN1" edc:nzwidth="0x1" edc:desc="Priority Level 1 Enable"/>
            <edc:SFRFieldDef edc:cname="LVLEN2" edc:nzwidth="0x1" edc:desc="Priority Level 2 Enable"/>
            <edc:SFRFieldDef edc:cname="LVLEN3" edc:nzwidth="0x1" edc:desc="Priority Level 3 Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CRCCTRL" edc:nzwidth="0x10" edc:access="nnnnnnnn----nnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xFF0F" edc:_addr="0x41004002">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="CRCBEATSIZE" edc:nzwidth="0x2" edc:desc="CRC Beat Size">
              <edc:SFRFieldSemantic edc:cname="BYTE" edc:desc="8-bit bus transfer" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="HWORD" edc:desc="16-bit bus transfer" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="WORD" edc:desc="32-bit bus transfer" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CRCPOLY" edc:nzwidth="0x2" edc:desc="CRC Polynomial Type">
              <edc:SFRFieldSemantic edc:cname="CRC16" edc:desc="CRC-16 (CRC-CCITT)" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CRC32" edc:desc="CRC32 (IEEE 802.3)" edc:when="(field &amp; 0x3) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CRCSRC" edc:nzwidth="0x6" edc:desc="CRC Input Source">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="CRC Disabled" edc:when="(field &amp; 0x3F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="IO" edc:desc="I/O interface" edc:when="(field &amp; 0x3F) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CRCMODE" edc:nzwidth="0x2" edc:desc="CRC Operating Mode">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Default operating mode" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CRCMON" edc:desc="Memory CRC monitor operating mode" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="CRCGEN" edc:desc="Memory CRC generation operating mode" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CRCDATAIN" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41004004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="CRCDATAIN" edc:nzwidth="0x20" edc:desc="CRC Data Input"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CRCCHKSUM" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41004008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="CRCCHKSUM" edc:nzwidth="0x20" edc:desc="CRC Checksum"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CRCSTATUS" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x4100400C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="CRCBUSY" edc:nzwidth="0x1" edc:desc="CRC Module Busy"/>
            <edc:SFRFieldDef edc:cname="CRCZERO" edc:nzwidth="0x1" edc:desc="CRC Zero"/>
            <edc:SFRFieldDef edc:cname="CRCERR" edc:nzwidth="0x1" edc:desc="CRC Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
