Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31032.PIC
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="DBGCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x4100400D">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:nzwidth="0x1" edc:desc="Debug Run"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x4100400E"/>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="SWTRIGCTRL" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x41004010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="SWTRIG0" edc:nzwidth="0x1" edc:desc="Channel 0 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG1" edc:nzwidth="0x1" edc:desc="Channel 1 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG2" edc:nzwidth="0x1" edc:desc="Channel 2 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG3" edc:nzwidth="0x1" edc:desc="Channel 3 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG4" edc:nzwidth="0x1" edc:desc="Channel 4 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG5" edc:nzwidth="0x1" edc:desc="Channel 5 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG6" edc:nzwidth="0x1" edc:desc="Channel 6 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG7" edc:nzwidth="0x1" edc:desc="Channel 7 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG8" edc:nzwidth="0x1" edc:desc="Channel 8 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG9" edc:nzwidth="0x1" edc:desc="Channel 9 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG10" edc:nzwidth="0x1" edc:desc="Channel 10 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG11" edc:nzwidth="0x1" edc:desc="Channel 11 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG12" edc:nzwidth="0x1" edc:desc="Channel 12 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG13" edc:nzwidth="0x1" edc:desc="Channel 13 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG14" edc:nzwidth="0x1" edc:desc="Channel 14 Software Trigger"/>
            <edc:SFRFieldDef edc:cname="SWTRIG15" edc:nzwidth="0x1" edc:desc="Channel 15 Software Trigger"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="PRICTRL0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="01000000010000000100000001000000" edc:mclr="01000000010000000100000001000000" edc:_addr="0x41004014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="LVLPRI0" edc:nzwidth="0x5" edc:desc="Level 0 Channel Priority Number"/>
            <edc:SFRFieldDef edc:cname="QOS0" edc:nzwidth="0x2" edc:desc="Level 0 Quality of Service">
              <edc:SFRFieldSemantic edc:cname="REGULAR" edc:desc="Regular delivery" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SHORTAGE" edc:desc="Bandwidth shortage" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SENSITIVE" edc:desc="Latency sensitive" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="CRITICAL" edc:desc="Latency critical" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RRLVLEN0" edc:nzwidth="0x1" edc:desc="Level 0 Round-Robin Scheduling Enable"/>
            <edc:SFRFieldDef edc:cname="LVLPRI1" edc:nzwidth="0x5" edc:desc="Level 1 Channel Priority Number"/>
            <edc:SFRFieldDef edc:cname="QOS1" edc:nzwidth="0x2" edc:desc="Level 1 Quality of Service">
              <edc:SFRFieldSemantic edc:cname="REGULAR" edc:desc="Regular delivery" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SHORTAGE" edc:desc="Bandwidth shortage" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SENSITIVE" edc:desc="Latency sensitive" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="CRITICAL" edc:desc="Latency critical" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RRLVLEN1" edc:nzwidth="0x1" edc:desc="Level 1 Round-Robin Scheduling Enable"/>
            <edc:SFRFieldDef edc:cname="LVLPRI2" edc:nzwidth="0x5" edc:desc="Level 2 Channel Priority Number"/>
            <edc:SFRFieldDef edc:cname="QOS2" edc:nzwidth="0x2" edc:desc="Level 2 Quality of Service">
              <edc:SFRFieldSemantic edc:cname="REGULAR" edc:desc="Regular delivery" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SHORTAGE" edc:desc="Bandwidth shortage" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SENSITIVE" edc:desc="Latency sensitive" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="CRITICAL" edc:desc="Latency critical" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RRLVLEN2" edc:nzwidth="0x1" edc:desc="Level 2 Round-Robin Scheduling Enable"/>
            <edc:SFRFieldDef edc:cname="LVLPRI3" edc:nzwidth="0x5" edc:desc="Level 3 Channel Priority Number"/>
            <edc:SFRFieldDef edc:cname="QOS3" edc:nzwidth="0x2" edc:desc="Level 3 Quality of Service">
              <edc:SFRFieldSemantic edc:cname="REGULAR" edc:desc="Regular delivery" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SHORTAGE" edc:desc="Bandwidth shortage" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SENSITIVE" edc:desc="Latency sensitive" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="CRITICAL" edc:desc="Latency critical" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RRLVLEN3" edc:nzwidth="0x1" edc:desc="Level 3 Round-Robin Scheduling Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x41004018"/>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="INTPEND" edc:nzwidth="0x10" edc:access="nnnn-nnn---nnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xF71F" edc:_addr="0x41004020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="ID" edc:nzwidth="0x5" edc:desc="Channel ID"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TERR" edc:nzwidth="0x1" edc:desc="Transfer Error"/>
            <edc:SFRFieldDef edc:cname="TCMPL" edc:nzwidth="0x1" edc:desc="Transfer Complete"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:nzwidth="0x1" edc:desc="Channel Suspend"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERR" edc:nzwidth="0x1" edc:desc="CRC Error"/>
            <edc:SFRFieldDef edc:cname="FERR" edc:nzwidth="0x1" edc:desc="Fetch Error"/>
            <edc:SFRFieldDef edc:cname="BUSY" edc:nzwidth="0x1" edc:desc="Busy"/>
            <edc:SFRFieldDef edc:cname="PEND" edc:nzwidth="0x1" edc:desc="Pending"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x41004022"/>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="INTSTATUS" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x41004024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="CHINT0" edc:nzwidth="0x1" edc:desc="Channel 0 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT1" edc:nzwidth="0x1" edc:desc="Channel 1 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT2" edc:nzwidth="0x1" edc:desc="Channel 2 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT3" edc:nzwidth="0x1" edc:desc="Channel 3 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT4" edc:nzwidth="0x1" edc:desc="Channel 4 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT5" edc:nzwidth="0x1" edc:desc="Channel 5 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT6" edc:nzwidth="0x1" edc:desc="Channel 6 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT7" edc:nzwidth="0x1" edc:desc="Channel 7 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT8" edc:nzwidth="0x1" edc:desc="Channel 8 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT9" edc:nzwidth="0x1" edc:desc="Channel 9 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT10" edc:nzwidth="0x1" edc:desc="Channel 10 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT11" edc:nzwidth="0x1" edc:desc="Channel 11 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT12" edc:nzwidth="0x1" edc:desc="Channel 12 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT13" edc:nzwidth="0x1" edc:desc="Channel 13 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT14" edc:nzwidth="0x1" edc:desc="Channel 14 Pending Interrupt"/>
            <edc:SFRFieldDef edc:cname="CHINT15" edc:nzwidth="0x1" edc:desc="Channel 15 Pending Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="BUSYCH" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x41004028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="BUSYCH0" edc:nzwidth="0x1" edc:desc="Busy Channel 0"/>
            <edc:SFRFieldDef edc:cname="BUSYCH1" edc:nzwidth="0x1" edc:desc="Busy Channel 1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH2" edc:nzwidth="0x1" edc:desc="Busy Channel 2"/>
            <edc:SFRFieldDef edc:cname="BUSYCH3" edc:nzwidth="0x1" edc:desc="Busy Channel 3"/>
            <edc:SFRFieldDef edc:cname="BUSYCH4" edc:nzwidth="0x1" edc:desc="Busy Channel 4"/>
            <edc:SFRFieldDef edc:cname="BUSYCH5" edc:nzwidth="0x1" edc:desc="Busy Channel 5"/>
            <edc:SFRFieldDef edc:cname="BUSYCH6" edc:nzwidth="0x1" edc:desc="Busy Channel 6"/>
            <edc:SFRFieldDef edc:cname="BUSYCH7" edc:nzwidth="0x1" edc:desc="Busy Channel 7"/>
            <edc:SFRFieldDef edc:cname="BUSYCH8" edc:nzwidth="0x1" edc:desc="Busy Channel 8"/>
            <edc:SFRFieldDef edc:cname="BUSYCH9" edc:nzwidth="0x1" edc:desc="Busy Channel 9"/>
            <edc:SFRFieldDef edc:cname="BUSYCH10" edc:nzwidth="0x1" edc:desc="Busy Channel 10"/>
            <edc:SFRFieldDef edc:cname="BUSYCH11" edc:nzwidth="0x1" edc:desc="Busy Channel 11"/>
            <edc:SFRFieldDef edc:cname="BUSYCH12" edc:nzwidth="0x1" edc:desc="Busy Channel 12"/>
            <edc:SFRFieldDef edc:cname="BUSYCH13" edc:nzwidth="0x1" edc:desc="Busy Channel 13"/>
            <edc:SFRFieldDef edc:cname="BUSYCH14" edc:nzwidth="0x1" edc:desc="Busy Channel 14"/>
            <edc:SFRFieldDef edc:cname="BUSYCH15" edc:nzwidth="0x1" edc:desc="Busy Channel 15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="PENDCH" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x4100402C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="PENDCH0" edc:nzwidth="0x1" edc:desc="Pending Channel 0"/>
            <edc:SFRFieldDef edc:cname="PENDCH1" edc:nzwidth="0x1" edc:desc="Pending Channel 1"/>
            <edc:SFRFieldDef edc:cname="PENDCH2" edc:nzwidth="0x1" edc:desc="Pending Channel 2"/>
            <edc:SFRFieldDef edc:cname="PENDCH3" edc:nzwidth="0x1" edc:desc="Pending Channel 3"/>
            <edc:SFRFieldDef edc:cname="PENDCH4" edc:nzwidth="0x1" edc:desc="Pending Channel 4"/>
            <edc:SFRFieldDef edc:cname="PENDCH5" edc:nzwidth="0x1" edc:desc="Pending Channel 5"/>
            <edc:SFRFieldDef edc:cname="PENDCH6" edc:nzwidth="0x1" edc:desc="Pending Channel 6"/>
            <edc:SFRFieldDef edc:cname="PENDCH7" edc:nzwidth="0x1" edc:desc="Pending Channel 7"/>
            <edc:SFRFieldDef edc:cname="PENDCH8" edc:nzwidth="0x1" edc:desc="Pending Channel 8"/>
            <edc:SFRFieldDef edc:cname="PENDCH9" edc:nzwidth="0x1" edc:desc="Pending Channel 9"/>
            <edc:SFRFieldDef edc:cname="PENDCH10" edc:nzwidth="0x1" edc:desc="Pending Channel 10"/>
            <edc:SFRFieldDef edc:cname="PENDCH11" edc:nzwidth="0x1" edc:desc="Pending Channel 11"/>
            <edc:SFRFieldDef edc:cname="PENDCH12" edc:nzwidth="0x1" edc:desc="Pending Channel 12"/>
            <edc:SFRFieldDef edc:cname="PENDCH13" edc:nzwidth="0x1" edc:desc="Pending Channel 13"/>
            <edc:SFRFieldDef edc:cname="PENDCH14" edc:nzwidth="0x1" edc:desc="Pending Channel 14"/>
            <edc:SFRFieldDef edc:cname="PENDCH15" edc:nzwidth="0x1" edc:desc="Pending Channel 15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="ACTIVE" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrr--rrrrr----rrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF9F0F" edc:_addr="0x41004030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="LVLEX0" edc:nzwidth="0x1" edc:desc="Level 0 Channel Trigger Request Executing"/>
            <edc:SFRFieldDef edc:cname="LVLEX1" edc:nzwidth="0x1" edc:desc="Level 1 Channel Trigger Request Executing"/>
            <edc:SFRFieldDef edc:cname="LVLEX2" edc:nzwidth="0x1" edc:desc="Level 2 Channel Trigger Request Executing"/>
            <edc:SFRFieldDef edc:cname="LVLEX3" edc:nzwidth="0x1" edc:desc="Level 3 Channel Trigger Request Executing"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ID" edc:nzwidth="0x5" edc:desc="Active Channel ID"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ABUSY" edc:nzwidth="0x1" edc:desc="Active Channel Busy"/>
            <edc:SFRFieldDef edc:cname="BTCNT" edc:nzwidth="0x10" edc:desc="Active Channel Block Transfer Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="BASEADDR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41004034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="BASEADDR" edc:nzwidth="0x20" edc:desc="Descriptor Memory Base Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="WRBADDR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41004038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="WRBADDR" edc:nzwidth="0x20" edc:desc="Write-Back Memory Base Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4100403C"/>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CHANNEL0CHCTRLA" edc:nzwidth="0x20" edc:access="--nnnnnn--nn-----nnnnnnn-n----nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F307F43" edc:_addr="0x41004040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Channel Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Channel Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Channel Run in Standby"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIGSRC" edc:nzwidth="0x7" edc:desc="Trigger Source">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Only software/event triggers" edc:when="(field &amp; 0x7F) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="TRIGACT" edc:nzwidth="0x2" edc:desc="Trigger Action">
              <edc:SFRFieldSemantic edc:cname="BLOCK" edc:desc="One trigger required for each block transfer" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="BURST" edc:desc="One trigger required for each burst transfer" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="TRANSACTION" edc:desc="One trigger required for each transaction" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BURSTLEN" edc:nzwidth="0x4" edc:desc="Burst Length">
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="Single-beat burst length" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="2BEAT" edc:desc="2-beats burst length" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="3BEAT" edc:desc="3-beats burst length" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="4BEAT" edc:desc="4-beats burst length" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="5BEAT" edc:desc="5-beats burst length" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="6BEAT" edc:desc="6-beats burst length" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="7BEAT" edc:desc="7-beats burst length" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="8BEAT" edc:desc="8-beats burst length" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="9BEAT" edc:desc="9-beats burst length" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="10BEAT" edc:desc="10-beats burst length" edc:when="(field &amp; 0xF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="11BEAT" edc:desc="11-beats burst length" edc:when="(field &amp; 0xF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="12BEAT" edc:desc="12-beats burst length" edc:when="(field &amp; 0xF) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="13BEAT" edc:desc="13-beats burst length" edc:when="(field &amp; 0xF) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="14BEAT" edc:desc="14-beats burst length" edc:when="(field &amp; 0xF) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="15BEAT" edc:desc="15-beats burst length" edc:when="(field &amp; 0xF) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="16BEAT" edc:desc="16-beats burst length" edc:when="(field &amp; 0xF) == 0x0F"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="THRESHOLD" edc:nzwidth="0x2" edc:desc="FIFO Threshold">
              <edc:SFRFieldSemantic edc:cname="1BEAT" edc:desc="Destination write starts after each beat source address read" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="2BEATS" edc:desc="Destination write starts after 2-beats source address read" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="4BEATS" edc:desc="Destination write starts after 4-beats source address read" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="8BEATS" edc:desc="Destination write starts after 8-beats source address read" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
