Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31032.PIC
      <edc:SFRDef ltx:memberofperipheral="BLE" edc:cname="DPLL_RG2" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:_addr="0x410124BA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="BLE">
            <edc:SFRFieldDef edc:cname="DPLL_RG2BITS" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1B44" edc:_addr="0x410124BC"/>
      <edc:SFRDef ltx:memberofperipheral="BTZBSYS" edc:cname="SUBSYS_CNTRL_REG0" edc:nzwidth="0x20" edc:access="nnnnnnnnnn-nnnnn---------nnnn-nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFDF007B" edc:_addr="0x41014000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="BTZBSYS">
            <edc:SFRFieldDef edc:cname="zb_slp_ctrl" edc:nzwidth="0x1" edc:desc="zb_slp_ctrl"/>
            <edc:SFRFieldDef edc:cname="zb_soft_reset_in" edc:nzwidth="0x1" edc:desc="zb_soft_reset_in"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="zb_reset_by_fw" edc:nzwidth="0x1" edc:desc="zb_reset_by_fw"/>
            <edc:SFRFieldDef edc:cname="zb_en_main_clk" edc:nzwidth="0x1" edc:desc="zb_en_main_clk"/>
            <edc:SFRFieldDef edc:cname="ant_div_sel_1_iom_en" edc:nzwidth="0x1" edc:desc="ant_div_sel_1_iom_en"/>
            <edc:SFRFieldDef edc:cname="ant_div_sel_2_iom_en" edc:nzwidth="0x1" edc:desc="ant_div_sel_2_iom_en"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="bt_pdc_ov" edc:nzwidth="0x1" edc:desc="bt_pdc_ov"/>
            <edc:SFRFieldDef edc:cname="bt_sfr_wakeup_bit" edc:nzwidth="0x1" edc:desc="bt_sfr_wakeup_bit"/>
            <edc:SFRFieldDef edc:cname="bt_hw_rc_re_cal" edc:nzwidth="0x1" edc:desc="bt_hw_rc_re_cal"/>
            <edc:SFRFieldDef edc:cname="bt_reset_by_fw" edc:nzwidth="0x1" edc:desc="bt_reset_by_fw"/>
            <edc:SFRFieldDef edc:cname="bt_en_main_clk" edc:nzwidth="0x1" edc:desc="bt_en_main_clk"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="subsys_dbg_bus_sel_top" edc:nzwidth="0x1" edc:desc="subsys_dbg_bus_sel_top"/>
            <edc:SFRFieldDef edc:cname="aclb_soft_rst_n" edc:nzwidth="0x1" edc:desc="aclb_soft_rst_n"/>
            <edc:SFRFieldDef edc:cname="aclb_pwr_rst_n" edc:nzwidth="0x1" edc:desc="aclb_pwr_rst_n"/>
            <edc:SFRFieldDef edc:cname="subsys_dbg_bus_sel" edc:nzwidth="0x1" edc:desc="subsys_dbg_bus_sel"/>
            <edc:SFRFieldDef edc:cname="disable_pclk_arb" edc:nzwidth="0x1" edc:desc="disable_pclk_arb"/>
            <edc:SFRFieldDef edc:cname="disable_pclk_zb_mac" edc:nzwidth="0x1" edc:desc="disable_pclk_zb_mac"/>
            <edc:SFRFieldDef edc:cname="disable_pclk_bt" edc:nzwidth="0x1" edc:desc="disable_pclk_bt"/>
            <edc:SFRFieldDef edc:cname="ant_div_sel_ovrd_val" edc:nzwidth="0x2" edc:desc="ant_div_sel_ovrd_val"/>
            <edc:SFRFieldDef edc:cname="ant_div_sel_ovrd_en" edc:nzwidth="0x1" edc:desc="ant_div_sel_ovrd_en"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="BTZBSYS" edc:cname="SUBSYS_CNTRL_REG1" edc:nzwidth="0x20" edc:access="nnnnnn--nnnnnnnnnnnnnn---nnnnnnn" edc:por="00000000000000000001100000000000" edc:mclr="00000000000000000001100000000000" edc:impl="0xFCFFFC7F" edc:_addr="0x41014004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="BTZBSYS">
            <edc:SFRFieldDef edc:cname="subsys_dbg_bus_sel_top" edc:nzwidth="0x2" edc:desc="subsys_dbg_bus_sel_top"/>
            <edc:SFRFieldDef edc:cname="subsys_dbg_bus_sel" edc:nzwidth="0x2" edc:desc="subsys_dbg_bus_sel"/>
            <edc:SFRFieldDef edc:cname="subsys_clk_src_sel" edc:nzwidth="0x2" edc:desc="subsys_clk_src_sel"/>
            <edc:SFRFieldDef edc:cname="ssubsys_clk_div_sel" edc:nzwidth="0x1" edc:desc="subsys_clk_div_sel"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="disable_one_sec_counter" edc:nzwidth="0x1" edc:desc="disable_one_sec_counter"/>
            <edc:SFRFieldDef edc:cname="subsys_dbg_bus_en" edc:nzwidth="0x1" edc:desc="subsys_dbg_bus_en"/>
            <edc:SFRFieldDef edc:cname="subsys_xtal_ready_delay" edc:nzwidth="0x4" edc:desc="subsys_xtal_ready_delay"/>
            <edc:SFRFieldDef edc:cname="tr_sw_iom_en" edc:nzwidth="0x1" edc:desc="tr_sw_iom_en"/>
            <edc:SFRFieldDef edc:cname="tr_sw_n_iom_en" edc:nzwidth="0x1" edc:desc="tr_sw_n_iom_en"/>
            <edc:SFRFieldDef edc:cname="pa_on_iom_en" edc:nzwidth="0x1" edc:desc="pa_on_iom_en"/>
            <edc:SFRFieldDef edc:cname="lna_on_iom_en" edc:nzwidth="0x1" edc:desc="lna_on_iom_en"/>
            <edc:SFRFieldDef edc:cname="zb_bt_bar_ovrd_en" edc:nzwidth="0x1" edc:desc="zb_bt_bar_ovrd_en"/>
            <edc:SFRFieldDef edc:cname="zb_bt_bar_ovrd_val" edc:nzwidth="0x1" edc:desc="zb_bt_bar_ovrd_val"/>
            <edc:SFRFieldDef edc:cname="invert_btadc_clk" edc:nzwidth="0x1" edc:desc="invert_btadc_clk"/>
            <edc:SFRFieldDef edc:cname="clk_lp_req" edc:nzwidth="0x1" edc:desc="clk_lp_req"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="xtal_lock_cnt_rstn_ovrd_en" edc:nzwidth="0x1" edc:desc="xtal_lock_cnt_rstn_ovrd_en"/>
            <edc:SFRFieldDef edc:cname="xtal_lock_cnt_rstn_ovrd_val" edc:nzwidth="0x1" edc:desc="xtal_lock_cnt_rstn_ovrd_val"/>
            <edc:SFRFieldDef edc:cname="pll_lock_flops_rstn_ovrd_en" edc:nzwidth="0x1" edc:desc="pll_lock_flops_rstn_ovrd_en"/>
            <edc:SFRFieldDef edc:cname="pll_lock_flops_rstn_ovrd_val" edc:nzwidth="0x1" edc:desc="pll_lock_flops_rstn_ovrd_val"/>
            <edc:SFRFieldDef edc:cname="die_clk_sel" edc:nzwidth="0x1" edc:desc="die_clk_sel"/>
            <edc:SFRFieldDef edc:cname="disable_adc_clk_gating" edc:nzwidth="0x1" edc:desc="disable_adc_clk_gating"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="BTZBSYS" edc:cname="SUBSYS_CNTRL_REG2" edc:nzwidth="0x20" edc:access="nnnnnn---nnn-nnn-nnn-nnn-nnn-nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFC777777" edc:_addr="0x41014008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="BTZBSYS">
            <edc:SFRFieldDef edc:cname="crossbar_data_line_sel_0" edc:nzwidth="0x3" edc:desc="crossbar_data_line_sel_0"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="crossbar_data_line_sel_1" edc:nzwidth="0x3" edc:desc="crossbar_data_line_sel_1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="crossbar_data_line_sel_2" edc:nzwidth="0x3" edc:desc="crossbar_data_line_sel_2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="crossbar_data_line_sel_3" edc:nzwidth="0x3" edc:desc="crossbar_data_line_sel_3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="crossbar_data_line_sel_4" edc:nzwidth="0x3" edc:desc="crossbar_data_line_sel_4"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="crossbar_data_line_sel_5" edc:nzwidth="0x3" edc:desc="crossbar_data_line_sel_5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="crossbar_data_invert" edc:nzwidth="0x6" edc:desc="crossbar_data_invert"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="BTZBSYS" edc:cname="SUBSYS_CNTRL_REG3" edc:nzwidth="0x20" edc:access="------------------nnnnnnnnnnnnnn" edc:por="00000000000000000000001001000000" edc:mclr="00000000000000000000001001000000" edc:impl="0x3FFF" edc:_addr="0x4101400C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="BTZBSYS">
            <edc:SFRFieldDef edc:cname="le_2m_fpga_v1c0_mode" edc:nzwidth="0x1" edc:desc="le_2m_fpga_v1c0_mode"/>
            <edc:SFRFieldDef edc:cname="subsys_pll_ready_delay" edc:nzwidth="0x6" edc:desc="subsys_pll_ready_delay"/>
            <edc:SFRFieldDef edc:cname="disable_pclk_dfe" edc:nzwidth="0x1" edc:desc="disable_pclk_dfe"/>
            <edc:SFRFieldDef edc:cname="disable_pclk_zb_mdm" edc:nzwidth="0x1" edc:desc="disable_pclk_zb_mdm"/>
            <edc:SFRFieldDef edc:cname="pll_lock_fifo_en" edc:nzwidth="0x1" edc:desc="pll_lock_fifo_en"/>
            <edc:SFRFieldDef edc:cname="pll_auto_relock_en" edc:nzwidth="0x1" edc:desc="pll_auto_relock_en"/>
            <edc:SFRFieldDef edc:cname="pll_lock_fifo_empty_soft_reset" edc:nzwidth="0x1" edc:desc="pll_lock_fifo_empty_soft_reset"/>
            <edc:SFRFieldDef edc:cname="pll_lock_fifo_clk_src_sel" edc:nzwidth="0x1" edc:desc="pll_lock_fifo_clk_src_sel"/>
            <edc:SFRFieldDef edc:cname="pll_lock_fifo_empty_rst_en" edc:nzwidth="0x1" edc:desc="pll_lock_fifo_empty_rst_en"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x41014010"/>
      <edc:SFRDef ltx:memberofperipheral="BTZBSYS" edc:cname="SUBSYS_STATUS_REG0" edc:nzwidth="0x20" edc:access="--------------rr-------------rrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x30007" edc:_addr="0x41014020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="BTZBSYS">
            <edc:SFRFieldDef edc:cname="zb_sleep_mode" edc:nzwidth="0x1" edc:desc="zb_sleep_mode"/>
            <edc:SFRFieldDef edc:cname="zb_deep_sleep_mode" edc:nzwidth="0x1" edc:desc="zb_deep_sleep_mode"/>
            <edc:SFRFieldDef edc:cname="radio_idle_zb" edc:nzwidth="0x1" edc:desc="radio_idle_zb"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="bt_low_power_mode" edc:nzwidth="0x1" edc:desc="bt_low_power_mode"/>
            <edc:SFRFieldDef edc:cname="bt_rf_idle" edc:nzwidth="0x1" edc:desc="bt_rf_idle"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
