Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31032.PIC
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_CONTROL_KEY1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43011014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="KEY1" edc:nzwidth="0x20" edc:desc="Key register."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_CONTROL_KEY2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43011018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="KEY2" edc:nzwidth="0x20" edc:desc="Key register."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_CONTROL_KEY3" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4301101C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="KEY3" edc:nzwidth="0x20" edc:desc="Key register (LSB)."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_CONTROL_TESTDATA" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43011020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="TESTDATA" edc:nzwidth="0x20" edc:desc="Test data register."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_CONTROL_REPEATTHRESHOLD" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43011024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="REPEATTHRESHOLD" edc:nzwidth="0x20" edc:desc="Repetition Test Count Cut-Off value."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_CONTROL_PROPTHRESHOLD" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43011028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="PROPTHRESHOLD" edc:nzwidth="0x20" edc:desc="Adaptive Proportion Test (1024-sample window) Cut-Off value."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4301102C"/>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_CONTROL_STATUS" edc:nzwidth="0x20" edc:access="--------------------nnnnn-nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFBF" edc:_addr="0x43011030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="TESTDATABUSY" edc:nzwidth="0x1" edc:desc="High when data written to TestData register is being processed. (see section 4.7)"/>
            <edc:SFRFieldDef edc:cname="STATE" edc:nzwidth="0x3" edc:desc="State of the control FSM: 000: Reset, 001: Startup, 010: Idle (Rings On), 011: Idle (Rings Off), 100: Fill FIFO, 101: Error, 110: Unused, 111: Unused."/>
            <edc:SFRFieldDef edc:cname="REPFAIL" edc:nzwidth="0x1" edc:desc="NIST-800-90B repetition Count Test interrupt status."/>
            <edc:SFRFieldDef edc:cname="PROPFAIL" edc:nzwidth="0x1" edc:desc="NIST-800-90B adaptive Proportion Test (1024-sample window) interrupt status."/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FULLINT" edc:nzwidth="0x1" edc:desc="FIFO full status."/>
            <edc:SFRFieldDef edc:cname="PREINT" edc:nzwidth="0x1" edc:desc="AIS31 preliminary noise alarm interrupt status."/>
            <edc:SFRFieldDef edc:cname="ALMINT" edc:nzwidth="0x1" edc:desc="AIS31 noise alarm interrupt status."/>
            <edc:SFRFieldDef edc:cname="STARTUPFAIL" edc:nzwidth="0x1" edc:desc="Start-up test failure."/>
            <edc:SFRFieldDef edc:cname="FIFOACCFAIL" edc:nzwidth="0x1" edc:desc="Set when a FIFO data read is performed while the NDRNG is disabled AND has its FIFO empty (FIFOLevel = 0)."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_CONTROL_INITWAITVAL" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:por="00000000000000001111111111111111" edc:mclr="00000000000000001111111111111111" edc:impl="0xFFFF" edc:_addr="0x43011034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="INITWAITVAL" edc:nzwidth="0x10" edc:desc="Number of clock cycles to wait before sampling data from the noise source."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_CONTROL_DISABLEOSC0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43011038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="DISABLEOSC0" edc:nzwidth="0x20" edc:desc="Disable oscillator rings #0 to #31."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
