Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31032.PIC
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_CONTROL_DISABLEOSC1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4301103C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="DISABLEOSC1" edc:nzwidth="0x20" edc:desc="Disable oscillator rings #32 to #63."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_CONTROL_SWOFFTMRVAL" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x43011040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="SWOFFTMRVAL" edc:nzwidth="0x10" edc:desc="Number of clk cycles to wait before stopping the rings after the FIFO is full."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_CONTROL_CLKDIV" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF" edc:_addr="0x43011044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="CLKDIV" edc:nzwidth="0x8" edc:desc="Sample clock divider. The frequency at which the outputs of the rings are sampled is given by: Fs=Fpclk/(ClkDiv+1)."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_CONTROL_AIS31CONF0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43011048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="STARTUPTHRESHOLD" edc:nzwidth="0x10" edc:desc="Start-up test threshold."/>
            <edc:SFRFieldDef edc:cname="ONLINETHRESHOLD" edc:nzwidth="0x10" edc:desc="Online threshold."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_CONTROL_AIS31CONF1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4301104C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="ONLINEREPTHRESHOLD" edc:nzwidth="0x10" edc:desc="Online repeat threshold."/>
            <edc:SFRFieldDef edc:cname="HEXPECTEDVALUE" edc:nzwidth="0x10" edc:desc="Expected history value."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_CONTROL_AIS31CONF2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x43011050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="HMIN" edc:nzwidth="0x10" edc:desc="Minimum allowed history value."/>
            <edc:SFRFieldDef edc:cname="HMAX" edc:nzwidth="0x10" edc:desc="Maximum allowed history value."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_CONTROL_AIS31STATUS" edc:nzwidth="0x20" edc:access="--------------nnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FFFF" edc:_addr="0x43011054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="NUMPRELIMALARMS" edc:nzwidth="0x10" edc:desc="Number of preliminary noise alarms since counter was last cleared."/>
            <edc:SFRFieldDef edc:cname="PRELIMNOISEALARMRNG" edc:nzwidth="0x1" edc:desc="Last preliminary noise alarm occurred due to history value out of range."/>
            <edc:SFRFieldDef edc:cname="PRELIMNOISEALARMREP" edc:nzwidth="0x1" edc:desc="Last preliminary noise alarm occurred due to consecutive high X**2."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0RNG_CONTROL_HWCONFIG" edc:nzwidth="0x20" edc:access="----------------------rrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FF" edc:_addr="0x43011058">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="NUMBOFRINGS" edc:nzwidth="0x8" edc:desc="Generic g_NumRings value."/>
            <edc:SFRFieldDef edc:cname="AIS31" edc:nzwidth="0x1" edc:desc="Generic g_AIS31 value."/>
            <edc:SFRFieldDef edc:cname="AIS31Full" edc:nzwidth="0x1" edc:desc="Generic g_AIS31Full value."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xFA4" edc:_addr="0x4301105C"/>
      <edc:SFRDef ltx:memberofperipheral="SILEX" edc:cname="SFR0PK_POINTERS" edc:nzwidth="0x20" edc:access="----nnnn----nnnn----nnnn----nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF0F0F0F" edc:_addr="0x43012000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SILEX">
            <edc:SFRFieldDef edc:cname="OPPTRA" edc:nzwidth="0x4" edc:desc="When executing primitive arithmetic operations, this pointer defines where operand A is located in memory (location 0x0 to 0xF)."/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="OPPTRB" edc:nzwidth="0x4" edc:desc="When executing primitive arithmetic operations, this pointer defines where operand B is located in memory (location 0x0 to 0xF)."/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="OPPTRC" edc:nzwidth="0x4" edc:desc="When executing primitive arithmetic operations, this pointer defines the location (0x0 to 0xF) where the result will be stored in memory."/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="OPPTRN" edc:nzwidth="0x4" edc:desc="When executing primitive arithmetic operations, this pointer defines the location where the modulus is located in memory (location 0x0 to 0xF)."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
