Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31032.PIC
      <edc:AdjustPoint edc:offset="0x1C" edc:_addr="0x440008D4"/>
      <edc:SFRDef ltx:memberofperipheral="PFW" edc:cname="DFT_VALCON" edc:nzwidth="0x20" edc:access="----------------n---------------" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x8000" edc:_addr="0x440008F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="VAL_ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x440008F4"/>
      <edc:SFRDef ltx:memberofperipheral="PFW" edc:cname="DFT_VALP1RR01" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000900">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="PR1RR0" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="P1RR1" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44000904"/>
      <edc:SFRDef ltx:memberofperipheral="PFW" edc:cname="DFT_VALP1RR23" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000910">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="PR1RR2" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="P1RR3" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44000914"/>
      <edc:SFRDef ltx:memberofperipheral="PFW" edc:cname="DFT_VALP1RR45" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000920">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="PR1RR4" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="P1RR5" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44000924"/>
      <edc:SFRDef ltx:memberofperipheral="PFW" edc:cname="DFT_VALP1RR67" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000930">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="PR1RR6" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="P1RR7" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44000934"/>
      <edc:SFRDef ltx:memberofperipheral="PFW" edc:cname="DFT_VALP2RR01" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000940">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="PR2RR0" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="P2RR1" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44000944"/>
      <edc:SFRDef ltx:memberofperipheral="PFW" edc:cname="DFT_VALP2RR23" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000950">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="PR2RR2" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="P2RR3" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44000954"/>
      <edc:SFRDef ltx:memberofperipheral="PFW" edc:cname="DFT_VALP2RR45" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000960">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="PR2RR4" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="P2RR5" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44000964"/>
      <edc:SFRDef ltx:memberofperipheral="PFW" edc:cname="DFT_VALP2RR67" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000970">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="PR2RR6" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="P2RR7" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8C" edc:_addr="0x44000974"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="OSCCON" edc:nzwidth="0x20" edc:access="-----nnnn-n-----nnnnnnnnn--nn-nn" edc:por="00000000001000000000000000000101" edc:mclr="00000000001000000000000000000101" edc:impl="0x7A0FF9B" edc:_addr="0x44000A00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:SFRFieldDef edc:cname="OSWEN" edc:nzwidth="0x1" edc:desc="Oscillator Switch Enable bit">
              <edc:SFRFieldSemantic edc:cname="SWITCH" edc:desc="Request oscillator switch to selection specified by NOSC[3:0] bits" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SWITCH_COMPLETE" edc:desc="Oscillator switch is complete" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SOSCEN" edc:nzwidth="0x1" edc:desc="32 kHz Secondary (LP) Oscillator Enable bit">
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Enable Secondary Oscillator" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Disable Secondary Oscillator" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CF" edc:nzwidth="0x1" edc:desc="Clock Fail Detect bit (Read / writable / Clearable by application)">
              <edc:SFRFieldSemantic edc:cname="FAIL_DET" edc:desc="FSCM has detected clock failure" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_FAILDET" edc:desc="FSCM has not detected clock failure" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SLPEN" edc:nzwidth="0x1" edc:desc="Enable SLEEP Mode bit">
              <edc:SFRFieldSemantic edc:cname="SLEEP" edc:desc="When a WAIT Instruction is executed device will enter SLEEP Mode" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="IDLE" edc:desc="When a WAIT instruction is executed device will enter IDLE Mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CLKLOCK" edc:nzwidth="0x1" edc:desc="Clock Lock Enabled bit">
              <edc:SFRFieldSemantic edc:cname="LOCKED" edc:desc="All clock and PLL configuration registers are locked.  These include OSCCON, OSCTRIM, SPLLCON, UPLLCON, PBxDIV" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="UNLOCKED" edc:desc="Clock and PLL selection registers are not locked, configurations may be modified" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NOSC" edc:nzwidth="0x4" edc:desc="New Oscillator Selection bits">
              <edc:SFRFieldSemantic edc:cname="FRCDIV" edc:desc="Fast RC Oscillator (FRC) divided by OSCCON.FRCDIV ( Supports FRC/16 and FRC/1)" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SPLL" edc:desc="System PLL (SPLL1 Module) (input clock and divider set by SPLLCON)" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="POSC" edc:desc="Primary Oscillator" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SOSC" edc:desc="Secondary Oscillator (SOSC)" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="LPRC" edc:desc="Low Power RC Oscillator (LPRC)" edc:when="(field &amp; 0xF) == 0x04"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="COSC" edc:nzwidth="0x4" edc:desc="Current Oscillator Selection bits (Read-only)">
              <edc:SFRFieldSemantic edc:cname="FRCDIV" edc:desc="Fast RC Oscillator (FRC) divided by OSCCON.FRCDIV (Supports FRC/16 and FRC/1)" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SPLL" edc:desc="System PLL (SPLL1 Module) (input clock and divider set by SPLLCON)" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="POSC" edc:desc="Primary Oscillator- POSC" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SOSC" edc:desc="Secondary Oscillator (SOSC)" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="LPRC" edc:desc="Low Power RC Oscillator (LPRC)" edc:when="(field &amp; 0xF) == 0x04"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="WAKE2SPD" edc:nzwidth="0x1" edc:desc="2-Speed startup enabled in Sleep mode bit">
              <edc:SFRFieldSemantic edc:cname="FRC" edc:desc="When the device EXITS Sleep Mode, the sys_clk will be from FRC until the selected clock is ready" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SELECTED_CLK" edc:desc="When the device EXITS Sleep Mode, the sys_clk will be from the selected clock." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DRMEN" edc:nzwidth="0x1" edc:desc="Enable Dream Mode bit">
              <edc:SFRFieldSemantic edc:cname="SLEEP" edc:desc="When the cpu_si_sleep input is asserted and SLPEN = 1, DMA transfer complete causes SLEEP Mode to be entered" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_EFFECT" edc:desc="DMA transfer has no effect" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FRCDIV" edc:nzwidth="0x3" edc:desc="Fast RC Clock Divider bits">
              <edc:SFRFieldSemantic edc:cname="DIV_1" edc:desc="FRC Divide by 1" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DIV_2" edc:desc="FRC Divide by 2" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV_4" edc:desc="FRC Divide by 4" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DIV_8" edc:desc="FRC Divide by 8" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="DIV_16" edc:desc="FRC Divide by 16" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DIV_32" edc:desc="FRC Divide by 32" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="DIV_64" edc:desc="FRC Divide by 64" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="DIV_256" edc:desc="FRC Divide by 256" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="OSCCONCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000A04"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="OSCCONSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000A08"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="OSCCONINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000A0C"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="OSCTUN" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F" edc:_addr="0x44000A10">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:SFRFieldDef edc:cname="TUN" edc:nzwidth="0x6" edc:desc="Internal Fast RC (FRC) Oscillator Tuning bits">
              <edc:SFRFieldSemantic edc:cname="Max" edc:desc="Maximum Frequency" edc:when="(field &amp; 0x3F) == 0x1F"/>
              <edc:SFRFieldSemantic edc:cname="Center" edc:desc="Center Frequency, oscillator is running at calibrated frequency" edc:when="(field &amp; 0x3F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="Min" edc:desc="Minimum Frequency" edc:when="(field &amp; 0x3F) == 0x20"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="OSCTUNCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000A14"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="OSCTUNSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000A18"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="OSCTUNINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000A1C"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="SPLLCON" edc:nzwidth="0x20" edc:access="nn----------nnnnnnnnnnnn--nnn---" edc:por="11000000000000010000000000101000" edc:mclr="11000000000000010000000000101000" edc:impl="0xC00FFF38" edc:_addr="0x44000A20">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SPLLPWDN" edc:nzwidth="0x1" edc:desc="PLL Power Down Register bit">
              <edc:SFRFieldSemantic edc:cname="PLL_OFF" edc:desc="PLL is powered down" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="PLL_ON" edc:desc="PLL is active" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SPLLFLOCK" edc:nzwidth="0x1" edc:desc="System PLL Force Lock">
              <edc:SFRFieldSemantic edc:cname="ASSERT" edc:desc="Force the SPLL lock signal to be asserted" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_ASSERT" edc:desc="Do not force the SPLL lock signal to be asserted" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SPLLRST" edc:nzwidth="0x1" edc:desc="System PLL Reset">
              <edc:SFRFieldSemantic edc:cname="ASSERT" edc:desc="Assert the reset to the SPLL" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_ASSERT" edc:desc="De-assert the reset to the SPLL" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SPLLPOSTDIV1" edc:nzwidth="0x8" edc:desc="SPLL Clock 1 Divide Value, 1 to 255"/>
            <edc:SFRFieldDef edc:cname="SPLLPOSTDIV2" edc:nzwidth="0x4" edc:desc="SPLL Clock 2 Divide Value, 1 to 15">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Disable" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DIV_1" edc:desc="Second post divide by 1" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV_2" edc:desc="Second post divide by 2" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DIV_3" edc:desc="Second post divide by 3" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="DIV_4" edc:desc="Second post divide by 4" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DIV_5" edc:desc="Second post divide by 5" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="DIV_6" edc:desc="Second post divide by 6" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="DIV_7" edc:desc="Second post divide by 7" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="DIV_8" edc:desc="Second post divide by 8" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="DIV_9" edc:desc="Second post divide by 9" edc:when="(field &amp; 0xF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="DIV_10" edc:desc="Second post divide by 10" edc:when="(field &amp; 0xF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="DIV_11" edc:desc="Second post divide by 11" edc:when="(field &amp; 0xF) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="DIV_12" edc:desc="Second post divide by 12" edc:when="(field &amp; 0xF) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="DIV_13" edc:desc="Second post divide by 13" edc:when="(field &amp; 0xF) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="DIV_14" edc:desc="Second post divide by 14" edc:when="(field &amp; 0xF) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="DIV_15" edc:desc="Second post divide by 15" edc:when="(field &amp; 0xF) == 0x0F"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="SPLL_BYP" edc:nzwidth="0x2" edc:desc="SPLL Clock 2 Source">
              <edc:SFRFieldSemantic edc:cname="SPLL3" edc:desc="SPLL3 (RFPLL) Clock is the clock source for ADC CP Clock Generation." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="FRC" edc:desc="FRC is used as clock source for ADC CP Clock Generation." edc:when="(field &amp; 0x3) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="POSC" edc:desc="POSC is used as clock source for ADC CP Clock Generation." edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
