Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31032.PIC
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO5CONCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000AF4"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO5CONSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000AF8"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO5CONINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000AFC"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO5TRIM" edc:nzwidth="0x20" edc:access="nnnnnnnnn-----------------------" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF800000" edc:_addr="0x44000B00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:AdjustPoint edc:offset="0x17"/>
            <edc:SFRFieldDef edc:cname="ROTRIM" edc:nzwidth="0x9" edc:desc="Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock">
              <edc:SFRFieldSemantic edc:cname="ZERO" edc:desc="0/512 (0.0) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ONE" edc:desc="1/512 (0.001953125) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="TWO" edc:desc="2/512 (0.00390625) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="TRIM_256" edc:desc="256/512 (0.5000) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x100"/>
              <edc:SFRFieldSemantic edc:cname="TRIM_512" edc:desc="511/512 (0.998046875) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x1FF"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO5TRIMCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000B04"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO5TRIMSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000B08"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO5TRIMINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000B0C"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO6CON" edc:nzwidth="0x20" edc:access="-nnnnnnnnnnnnnnnnnnnn-nn----nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FFFFB0F" edc:_addr="0x44000B10">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:SFRFieldDef edc:cname="ROSEL" edc:nzwidth="0x4" edc:desc="Reference Clock Source Select bits">
              <edc:SFRFieldSemantic edc:cname="REFCLKI" edc:desc="REFI Pin" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="SYSCLK" edc:desc="System clock (reference clock reflects any device clock switching)" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="PBCLK1" edc:desc="Peripheral clock 1 (reference clock reflects any peripheral clock switching)" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="SPLL3" edc:desc="System PLL3 (Clock-3)" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="LPRC" edc:desc="LPRC" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="SOSC" edc:desc="SOSC" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="POSC" edc:desc="POSC" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SPLL1" edc:desc="System PLL1 (Clock-1)" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FRC" edc:desc="FRC" edc:when="(field &amp; 0xF) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:nzwidth="0x1" edc:desc="Reference Clock Request Status bit">
              <edc:SFRFieldSemantic edc:cname="ACTIVE" edc:desc="Reference clock request is active (User should not update this REFOCON register)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NOT_ACTIVE" edc:desc="Reference clock request is not active (User can update this REFOCON register)" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIVSWEN" edc:nzwidth="0x1" edc:desc="Clock RODIV/ROTRIM switch enabled.">
              <edc:SFRFieldSemantic edc:cname="SWINPROGRESS" edc:desc="Clock Divider Switching currently in progress." edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SWCOMPLETE" edc:desc="Clock Divider Switch has completed." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RSLP" edc:nzwidth="0x1" edc:desc="Reference Oscillator Run in Sleep bit">
              <edc:SFRFieldSemantic edc:cname="RSLP" edc:desc="Reference Oscillator output continues to run in Sleep" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_RSLP" edc:desc="Reference Oscillator output is disabled in Sleep" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="OE" edc:nzwidth="0x1" edc:desc="Reference Clock Output Enable bit">
              <edc:SFRFieldSemantic edc:cname="REFO6_OE" edc:desc="Reference clock is driven out on REFO6 pin" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_REFO6_OE" edc:desc="Reference clock is not driven out on REFO6 pin." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIDL" edc:nzwidth="0x1" edc:desc="Peripheral Stop in Idle Mode bit">
              <edc:SFRFieldSemantic edc:cname="SIDL" edc:desc="Discontinue module operation when device enters Idle mode" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_SIDL" edc:desc="Continue module operation in Idle mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FRZ" edc:nzwidth="0x1" edc:desc="Freeze in Debug mode bit">
              <edc:SFRFieldSemantic edc:cname="FRZ" edc:desc="When emulator is in Debug mode, module freezes operation" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_FRZ" edc:desc="When emulator is in Debug mode, module continues operation" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ON" edc:nzwidth="0x1" edc:desc="Output Enable bit">
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Reference Oscillator Module enabled" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Reference Oscillator Module disabled" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RODIV" edc:nzwidth="0xF" edc:desc="Reference Clock Divider bits">
              <edc:SFRFieldSemantic edc:cname="65K" edc:desc="REFO6 clock is Base clock frequency divided by 65,534 (32,767 *2)" edc:when="(field &amp; 0x7FFF) == 0x7FFF"/>
              <edc:SFRFieldSemantic edc:cname="4" edc:desc="REFO6 clock is Base clock frequency divided by 4 (2*2)" edc:when="(field &amp; 0x7FFF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="2" edc:desc="REFO6 clock is Base clock frequency divided by 2 (1*2)" edc:when="(field &amp; 0x7FFF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="REFO6 clock is same frequency as Base clock (no divider)" edc:when="(field &amp; 0x7FFF) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO6CONCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000B14"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO6CONSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000B18"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO6CONINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000B1C"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO6TRIM" edc:nzwidth="0x20" edc:access="nnnnnnnnn-----------------------" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF800000" edc:_addr="0x44000B20">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:AdjustPoint edc:offset="0x17"/>
            <edc:SFRFieldDef edc:cname="ROTRIM" edc:nzwidth="0x9" edc:desc="Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock">
              <edc:SFRFieldSemantic edc:cname="ZERO" edc:desc="0/512 (0.0) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ONE" edc:desc="1/512 (0.001953125) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="TWO" edc:desc="2/512 (0.00390625) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="TRIM_256" edc:desc="256/512 (0.5000) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x100"/>
              <edc:SFRFieldSemantic edc:cname="TRIM_512" edc:desc="511/512 (0.998046875) divisor added to RODIV value" edc:when="(field &amp; 0x1FF) == 0x1FF"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO6TRIMCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000B24"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO6TRIMSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000B28"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="REFO6TRIMINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000B2C"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="PB1DIV" edc:nzwidth="0x20" edc:access="----------------n---n----nnnnnnn" edc:por="00000000000000001000100000000000" edc:mclr="00000000000000001000100000000000" edc:impl="0x887F" edc:_addr="0x44000B30">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:SFRFieldDef edc:cname="PBDIV" edc:nzwidth="0x7" edc:desc="PB1 Peripheral Clock Divisor Control value">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Divide by 1 PB1 Clock same frequency as sys_clk" edc:when="(field &amp; 0x7F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide by 2 PB1 Clock is 1/2 of sys_clk" edc:when="(field &amp; 0x7F) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV3" edc:desc="Divide by 3 PB1 Clock is 1/3 of sys_clk" edc:when="(field &amp; 0x7F) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Divide by 16 PB1 Clock is 1/16 of sys_clk" edc:when="(field &amp; 0x7F) == 0x0F"/>
              <edc:SFRFieldSemantic edc:cname="DIV17" edc:desc="Divide by 17 PB1 Clock is 1/17 of sys_clk" edc:when="(field &amp; 0x7F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="DIV127" edc:desc="Divide by 127 PB1 Clock is 1/127 of sys_clk" edc:when="(field &amp; 0x7F) == 0x7E"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="Divide by 128 PB1 Clock is 1/128 of sys_clk" edc:when="(field &amp; 0x7F) == 0x7F"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PBDIVRDY" edc:nzwidth="0x1" edc:desc="PB1 Peripheral Clock Divisor Ready">
              <edc:SFRFieldSemantic edc:cname="PB1RDY" edc:desc="Indicates the PB clock divisor logic is not switching divisors and the PB1DIV may be written." edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NOT_PB1RDY" edc:desc="Indicates the PB clock divisor logic is currently switching values and the PB1DIV cannot be written." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PBDIVON" edc:nzwidth="0x1" edc:desc="Output Enable bit">
              <edc:SFRFieldSemantic edc:cname="PB1ON" edc:desc="PB1 Output clock is enabled" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="PB1OFF" edc:desc="PB1 Output clock is disabled" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="PB1DIVCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000B34"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="PB1DIVSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000B38"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="PB1DIVINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000B3C"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="PB2DIV" edc:nzwidth="0x20" edc:access="----------------n---n----nnnnnnn" edc:por="00000000000000001000100000000000" edc:mclr="00000000000000001000100000000000" edc:impl="0x887F" edc:_addr="0x44000B40">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:SFRFieldDef edc:cname="PBDIV" edc:nzwidth="0x7" edc:desc="PB2 Peripheral Clock Divisor Control value">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Divide by 1 PB2 Clock same frequency as sys_clk" edc:when="(field &amp; 0x7F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide by 2 PB2 Clock is 1/2 of sys_clk" edc:when="(field &amp; 0x7F) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV3" edc:desc="Divide by 3 PB2 Clock is 1/3 of sys_clk" edc:when="(field &amp; 0x7F) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Divide by 16 PB2 Clock is 1/16 of sys_clk" edc:when="(field &amp; 0x7F) == 0x0F"/>
              <edc:SFRFieldSemantic edc:cname="DIV17" edc:desc="Divide by 17 PB2 Clock is 1/17 of sys_clk" edc:when="(field &amp; 0x7F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="DIV127" edc:desc="Divide by 127 PB2 Clock is 1/127 of sys_clk" edc:when="(field &amp; 0x7F) == 0x7E"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="Divide by 128 PB2 Clock is 1/128 of sys_clk" edc:when="(field &amp; 0x7F) == 0x7F"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PBDIVRDY" edc:nzwidth="0x1" edc:desc="PB2 Peripheral Clock Divisor Ready">
              <edc:SFRFieldSemantic edc:cname="PB2RDY" edc:desc="Indicates the PB clock divisor logic is not switching divisors and the PB2DIV may be written." edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NOT_PB2RDY" edc:desc="Indicates the PB clock divisor logic is currently switching values and the PB2DIV cannot be written." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PBDIVON" edc:nzwidth="0x1" edc:desc="Output Enable bit">
              <edc:SFRFieldSemantic edc:cname="PB2ON" edc:desc="PB2 Output clock is enabled" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="PB2OFF" edc:desc="PB2 Output clock is disabled" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="PB2DIVCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000B44"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="PB2DIVSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000B48"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="PB2DIVINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000B4C"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="PB3DIV" edc:nzwidth="0x20" edc:access="----------------n---n----nnnnnnn" edc:por="00000000000000001000100000001001" edc:mclr="00000000000000001000100000001001" edc:impl="0x887F" edc:_addr="0x44000B50">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:SFRFieldDef edc:cname="PBDIV" edc:nzwidth="0x7" edc:desc="PB3 Peripheral Clock Divisor Control value">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Divide by 1 PB3 Clock same frequency as sys_clk" edc:when="(field &amp; 0x7F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide by 2 PB3 Clock is 1/2 of sys_clk" edc:when="(field &amp; 0x7F) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV3" edc:desc="Divide by 3 PB3 Clock is 1/3 of sys_clk" edc:when="(field &amp; 0x7F) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Divide by 16 PB3 Clock is 1/16 of sys_clk" edc:when="(field &amp; 0x7F) == 0x0F"/>
              <edc:SFRFieldSemantic edc:cname="DIV17" edc:desc="Divide by 17 PB3 Clock is 1/17 of sys_clk" edc:when="(field &amp; 0x7F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="DIV127" edc:desc="Divide by 127 PB3 Clock is 1/127 of sys_clk" edc:when="(field &amp; 0x7F) == 0x7E"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="Divide by 128 PB3 Clock is 1/128 of sys_clk" edc:when="(field &amp; 0x7F) == 0x7F"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PBDIVRDY" edc:nzwidth="0x1" edc:desc="PB3 Peripheral Clock Divisor Ready">
              <edc:SFRFieldSemantic edc:cname="PB3RDY" edc:desc="Indicates the PB clock divisor logic is not switching divisors and the PB3DIV may be written." edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NOT_PB3RDY" edc:desc="Indicates the PB clock divisor logic is currently switching values and the PB3DIV cannot be written." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PBDIVON" edc:nzwidth="0x1" edc:desc="Output Enable bit">
              <edc:SFRFieldSemantic edc:cname="PB3ON" edc:desc="PB3 Output clock is enabled" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="PB3OFF" edc:desc="PB3 Output clock is disabled" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
