Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31032.PIC
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="SLEWCONCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000B64"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="SLEWCONSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000B68"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="SLEWCONINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44000B6C"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="CLKSTAT" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F" edc:_addr="0x44000B70">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:SFRFieldDef edc:cname="FRCRDY" edc:nzwidth="0x1" edc:desc="FRC Ready Status value">
              <edc:SFRFieldSemantic edc:cname="NOTRDY" edc:desc="FRC is not stable and not ready" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RDY" edc:desc="FRC is stable and ready" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SPLL1RDY" edc:nzwidth="0x1" edc:desc="System PLL1 Ready Status value">
              <edc:SFRFieldSemantic edc:cname="NOTRDY" edc:desc="SPLL1 Primary Output is not stable and not ready" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RDY" edc:desc="SPLL1 Primary Output is stable and ready" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="POSCRDY" edc:nzwidth="0x1" edc:desc="Primary Oscillator Ready Status value">
              <edc:SFRFieldSemantic edc:cname="NOTRDY" edc:desc="POSC is not stable and not ready" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RDY" edc:desc="POSC is stable and ready" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SOSCRDY" edc:nzwidth="0x1" edc:desc="SOSC Ready Status value">
              <edc:SFRFieldSemantic edc:cname="NOTRDY" edc:desc="SOSC is not stable and not ready" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RDY" edc:desc="SOSC is stable and ready" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LPRCRDY" edc:nzwidth="0x1" edc:desc="LPRC Ready Status value">
              <edc:SFRFieldSemantic edc:cname="NOTRDY" edc:desc="LPRC is not stable and not ready" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RDY" edc:desc="LPRC is stable and ready" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SPLL3RDY" edc:nzwidth="0x1" edc:desc="System PLL3 Ready Status value">
              <edc:SFRFieldSemantic edc:cname="NOTRDY" edc:desc="SPLL3 Output is not stable and not ready" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RDY" edc:desc="SPLL3 Output is stable and ready" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1C" edc:_addr="0x44000B74"/>
      <edc:SFRDef ltx:memberofperipheral="CRU" edc:cname="CLKDIAG" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn----------nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF003F" edc:_addr="0x44000B90">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:SFRFieldDef edc:cname="POSCSTOP" edc:nzwidth="0x1" edc:desc="POSC Clock Stop Control value">
              <edc:SFRFieldSemantic edc:cname="NORM" edc:desc="POSC clock source runs as normal" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="POSC clock source is stopped" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SOSCSTOP" edc:nzwidth="0x1" edc:desc="SOSC Clock Stop Control value">
              <edc:SFRFieldSemantic edc:cname="NORM" edc:desc="SOSC clock source runs as normal" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="SOSC clock source is stopped" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FRCSTOP" edc:nzwidth="0x1" edc:desc="FRC Clock Stop Control value">
              <edc:SFRFieldSemantic edc:cname="NORM" edc:desc="FRC clock source runs as normal" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="FRC clock source is stopped" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LPRCSTOP" edc:nzwidth="0x1" edc:desc="LPRC Clock Stop Control value">
              <edc:SFRFieldSemantic edc:cname="NORM" edc:desc="LPRC clock source runs as normal" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="LPRC clock source is stopped" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SPLL1STOP" edc:nzwidth="0x1" edc:desc="SPLL1 Clock Stop Control value">
              <edc:SFRFieldSemantic edc:cname="NORM" edc:desc="SPLL1 clock source runs as normal" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="SPLL1 clock source is stopped" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SPLL3STOP" edc:nzwidth="0x1" edc:desc="SPLL3 Clock Stop Control value">
              <edc:SFRFieldSemantic edc:cname="NORM" edc:desc="SPLL3 clock source runs as normal" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="SPLL3 clock source is stopped" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="NMICNT" edc:nzwidth="0x10" edc:desc="NMI Counter value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
