Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31032.PIC
      <edc:SFRDef ltx:memberofperipheral="PPS" edc:cname="RPB9G3R" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1F" edc:_addr="0x440012D8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PPS">
            <edc:SFRFieldDef edc:cname="RPB9G3R" edc:nzwidth="0x5" edc:desc="RPB9/G3">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="OFF" edc:when="(field &amp; 0x1F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SCOM0P0" edc:desc="SERCOM0/PAD0" edc:when="(field &amp; 0x1F) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SCOM0P3" edc:desc="SERCOM0/PAD3" edc:when="(field &amp; 0x1F) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="SCOM1P2" edc:desc="SERCOM1/PAD2" edc:when="(field &amp; 0x1F) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="SCOM1P3" edc:desc="SERCOM1/PAD3" edc:when="(field &amp; 0x1F) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO2" edc:desc="TCC0/WO2" edc:when="(field &amp; 0x1F) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO0" edc:desc="TCC0/WO0" edc:when="(field &amp; 0x1F) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="TCC0WO4" edc:desc="TCC0/WO4" edc:when="(field &amp; 0x1F) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO2" edc:desc="TCC1/WO2" edc:when="(field &amp; 0x1F) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO0" edc:desc="TCC1/WO0" edc:when="(field &amp; 0x1F) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="TCC1WO4" edc:desc="TCC1/WO4" edc:when="(field &amp; 0x1F) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="TCC2WO0" edc:desc="TCC2/WO0" edc:when="(field &amp; 0x1F) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="TC0WO0" edc:desc="TC0/WO0" edc:when="(field &amp; 0x1F) == 0x0F"/>
              <edc:SFRFieldSemantic edc:cname="TC1WO0" edc:desc="TC1/WO0" edc:when="(field &amp; 0x1F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="TC2WO0" edc:desc="TC2/WO0" edc:when="(field &amp; 0x1F) == 0x11"/>
              <edc:SFRFieldSemantic edc:cname="TC3WO0" edc:desc="TC3/WO0" edc:when="(field &amp; 0x1F) == 0x12"/>
              <edc:SFRFieldSemantic edc:cname="TC4WO0" edc:desc="TC4/WO0" edc:when="(field &amp; 0x1F) == 0x13"/>
              <edc:SFRFieldSemantic edc:cname="TC5WO0" edc:desc="TC5/WO0" edc:when="(field &amp; 0x1F) == 0x14"/>
              <edc:SFRFieldSemantic edc:cname="TC6WO0" edc:desc="TC6/WO0" edc:when="(field &amp; 0x1F) == 0x15"/>
              <edc:SFRFieldSemantic edc:cname="TC7WO0" edc:desc="TC7/WO0" edc:when="(field &amp; 0x1F) == 0x16"/>
              <edc:SFRFieldSemantic edc:cname="QCS" edc:desc="QCS" edc:when="(field &amp; 0x1F) == 0x17"/>
              <edc:SFRFieldSemantic edc:cname="QD1" edc:desc="QD1" edc:when="(field &amp; 0x1F) == 0x18"/>
              <edc:SFRFieldSemantic edc:cname="QD0" edc:desc="QD0" edc:when="(field &amp; 0x1F) == 0x19"/>
              <edc:SFRFieldSemantic edc:cname="QD3" edc:desc="QD3" edc:when="(field &amp; 0x1F) == 0x1A"/>
              <edc:SFRFieldSemantic edc:cname="CCLOUT0" edc:desc="CCLOUT0" edc:when="(field &amp; 0x1F) == 0x1B"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS1" edc:desc="TSTBUS1" edc:when="(field &amp; 0x1F) == 0x1C"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS4" edc:desc="TSTBUS4" edc:when="(field &amp; 0x1F) == 0x1D"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS7" edc:desc="TSTBUS7" edc:when="(field &amp; 0x1F) == 0x1E"/>
              <edc:SFRFieldSemantic edc:cname="TSTBUS10" edc:desc="TSTBUS10" edc:when="(field &amp; 0x1F) == 0x1F"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x124" edc:_addr="0x440012DC"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCON1" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnn-nnnn-nnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFEF7F" edc:_addr="0x44001400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="DMABL" edc:nzwidth="0x3" edc:desc="DMA to System RAM Buffer Length Size bits">
              <edc:SFRFieldSemantic edc:cname="128_DMABL" edc:desc="Allocates 128 locations in system memory to each analog input" edc:when="(field &amp; 0x7) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="64_DMABL" edc:desc="Allocates 64 locations in system memory to each analog input" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="32_DMABL" edc:desc="Allocates 32 locations in system memory to each analog input" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="16_DMABL" edc:desc="Allocates 16 locations in system memory to each analog input" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="8_DMABL" edc:desc="Allocates 8 locations in system memory to each analog input" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="4_DMABL" edc:desc="Allocates 4 locations in system memory to each analog input" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="2_DMABL" edc:desc="Allocates 2 locations in system memory to each analog input" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="1_DMABL" edc:desc="Allocates 1 location in system memory to each analog input" edc:when="(field &amp; 0x7) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STRGLVL" edc:nzwidth="0x1" edc:desc="Scan Trigger High Level/Positive Edge Sensitivity bit">
              <edc:SFRFieldSemantic edc:cname="SCTRIG_HIGH" edc:desc="Scan trigger is high level sensitive. Once STRIG mode is selected the scan trigger will continue for all selected analog inputs" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SCTRIG_POSEDGE" edc:desc="Scan trigger is positive edge sensitive. Once STRIG mode is selected only a single scan trigger will be generated which will complete the scan of all selected analog inputs. (TRGSRCx in the ADCTRGx register)" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="IRQVS" edc:nzwidth="0x3" edc:desc="Interrupt Vector Shift bits">
              <edc:SFRFieldSemantic edc:cname="SHL_7" edc:desc="Shift x left 7 bit position" edc:when="(field &amp; 0x7) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="SHL_6" edc:desc="Shift x left 6 bit position" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="SHL_5" edc:desc="Shift x left 5 bit position" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="SHL_4" edc:desc="Shift x left 4 bit position" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="SHL_3" edc:desc="Shift x left 3 bit position" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="SHL_2" edc:desc="Shift x left 2 bit position" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SHL_1" edc:desc="Shift x left 1 bit position" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SHL_0" edc:desc="Shift x left 0 bit position" edc:when="(field &amp; 0x7) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SCANEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSYUPB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSYDMA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CVD_EN" edc:nzwidth="0x1" edc:desc="CVD Enable bit"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:nzwidth="0x1" edc:desc="Stop in Idle Mode bit">
              <edc:SFRFieldSemantic edc:cname="DISCONTINUE" edc:desc="Discontinue module operation when device enters Idle mode" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CONTINUE" edc:desc="Continue module operation in Idle mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:nzwidth="0x1" edc:desc="ADC Module Enable bit">
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="ADC module is enabled" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="ADC module is disabled" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STRGSRC" edc:nzwidth="0x5" edc:desc="Scan Trigger Source Select bits">
              <edc:SFRFieldSemantic edc:cname="EXT_TRIG_VAL" edc:desc="External trigger for validation" edc:when="(field &amp; 0x1F) == 0x1F"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_47" edc:desc="ADC_TRIG_16" edc:when="(field &amp; 0x1F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_46" edc:desc="ADC_TRIG_15" edc:when="(field &amp; 0x1F) == 0x0F"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_45" edc:desc="ADC_TRIG_14" edc:when="(field &amp; 0x1F) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_44" edc:desc="ADC_TRIG_13" edc:when="(field &amp; 0x1F) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_43" edc:desc="ADC_TRIG_12" edc:when="(field &amp; 0x1F) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_42" edc:desc="ADC_TRIG_11" edc:when="(field &amp; 0x1F) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_41" edc:desc="ADC_TRIG_10" edc:when="(field &amp; 0x1F) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_40" edc:desc="ADC_TRIG_9" edc:when="(field &amp; 0x1F) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_39" edc:desc="ADC_TRIG_8" edc:when="(field &amp; 0x1F) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_38" edc:desc="ADC_TRIG_7" edc:when="(field &amp; 0x1F) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_37" edc:desc="ADC_TRIG_6" edc:when="(field &amp; 0x1F) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_36" edc:desc="ADC_TRIG_5" edc:when="(field &amp; 0x1F) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="INT0" edc:desc="INT0" edc:when="(field &amp; 0x1F) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="RESERVED" edc:desc="RESERVED" edc:when="(field &amp; 0x1F) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="SW_LVL" edc:desc="Software level trigger" edc:when="(field &amp; 0x1F) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SW_EDGE" edc:desc="Software edge trigger" edc:when="(field &amp; 0x1F) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Trigger" edc:when="(field &amp; 0x1F) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SELRES" edc:nzwidth="0x2" edc:desc="Shared ADC7 Resolution bits">
              <edc:SFRFieldSemantic edc:cname="12_BITS" edc:desc="12 bits (default)" edc:when="(field &amp; 0x3) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="10_BITS" edc:desc="10 bits" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="8_BITS" edc:desc="8 bits" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="6_BITS" edc:desc="6 bits" edc:when="(field &amp; 0x3) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FRACT" edc:nzwidth="0x1" edc:desc="Fractional Data Output Format bit">
              <edc:SFRFieldSemantic edc:cname="FRAC" edc:desc="Fractional" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="INT" edc:desc="Integer" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCON1CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44001404"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCON1SET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44001408"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCON1INV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4400140C"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCON2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnn-nnnn-nnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFEF7F" edc:_addr="0x44001410">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:nzwidth="0x7" edc:desc="Shared ADC Clock Divider bits"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCEIS" edc:nzwidth="0x3" edc:desc="Shared ADC Early Interrupt Select bits">
              <edc:SFRFieldSemantic edc:cname="8CLKS_EARLY" edc:desc="The data ready interrupt is generated 8 ADC clocks prior to end of conversion" edc:when="(field &amp; 0x7) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="7CLKS_EARLY" edc:desc="The data ready interrupt is generated 7 ADC clocks prior to end of conversion" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="6CLKS_EARLY" edc:desc="The data ready interrupt is generated 6 ADC clocks prior to end of conversion" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="5CLKS_EARLY" edc:desc="The data ready interrupt is generated 5 ADC clocks prior to end of conversion" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="4CLKS_EARLY" edc:desc="The data ready interrupt is generated 4 ADC clocks prior to end of conversion" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="3CLKS_EARLY" edc:desc="The data ready interrupt is generated 3 ADC clocks prior to end of conversion" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="2CLKS_EARLY" edc:desc="The data ready interrupt is generated 2 ADC module clocks prior to end of conversion" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="1CLKS_EARLY" edc:desc="The data ready interrupt is generated 1 ADC module clock prior to end of conversion" edc:when="(field &amp; 0x7) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ENXCNVRT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EOSIEN" edc:nzwidth="0x1" edc:desc="End of Scan Interrupt Enable bit">
              <edc:SFRFieldSemantic edc:cname="EOSRDY_INT" edc:desc="Interrupt will be generated when EOSRDY bit is set" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NOEOSRDY_INT" edc:desc="No interrupt is generated when the EOSRDY bit is set" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="REFFLTIEN" edc:nzwidth="0x1" edc:desc="Band Gap/ Vref Voltage Fault Interrupt Enable bit">
              <edc:SFRFieldSemantic edc:cname="REFFLT_INT" edc:desc="Interrupt will be generated when the REFFLT bit is set" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NOREFFLT_INT" edc:desc="No interrupt is generated when the REFFLT bit is set" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BGVRIEN" edc:nzwidth="0x1" edc:desc="Band Gap/ Vref Voltage Ready Interrupt Enable bit">
              <edc:SFRFieldSemantic edc:cname="BGVRDDY_INT" edc:desc="Interrupt will be generated when the BGVRDDY bit is set" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NOBGVRDDY_INT" edc:desc="No interrupt is generated when the BGVRRDY bit is set" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SAMC" edc:nzwidth="0xA" edc:desc="Sample Time for the Shared ADC (ADC7) bits"/>
            <edc:SFRFieldDef edc:cname="CVD_CPL" edc:nzwidth="0x3" edc:desc="CVD Partly Line Capacitor Setting bits"/>
            <edc:SFRFieldDef edc:cname="EOSRDY" edc:nzwidth="0x1" edc:desc="End of Scan Interrupt Status bit">
              <edc:SFRFieldSemantic edc:cname="SCAN_COMPLETE" edc:desc="All analog inputs are considered for scanning through the scan trigger (all analog inputs specified in the ADCCSS1 and ADCCSS2 registers) have completed scanning" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SCAN_NOT_COMPLETE" edc:desc="Scanning has not completed" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="REFFLT" edc:nzwidth="0x1" edc:desc="Band Gap/ Vref / AVdd BOR Fault Status bit">
              <edc:SFRFieldSemantic edc:cname="BG_VREF_FLT" edc:desc="Fault in band gap or the Vref voltage while the ON bit (ADCCON1) was set. Most likely a band gap or Vref fault will be caused by a BOR of the analog Vdd supply." edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="BG_VREF_OK" edc:desc="Band gap and Vref voltage are working properly" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BGVRRDY" edc:nzwidth="0x1" edc:desc="Band Gap Voltage/ADC Reference Voltage Status bit">
              <edc:SFRFieldSemantic edc:cname="VREF_RDY" edc:desc="Both band gap voltage and ADC reference voltages (Vref) are ready" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="VREF_NOTRDY" edc:desc="Either or both band gap voltage and ADC reference voltages (Vref) are not ready" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
