Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31032.PIC
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCON2CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44001414"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCON2SET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44001418"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCON2INV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4400141C"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCON3" edc:nzwidth="0x20" edc:access="nnnnnnnnn-------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF80FFFF" edc:_addr="0x44001420">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="ADINSEL" edc:nzwidth="0x6" edc:desc="Analog Input Select bits">
              <edc:SFRFieldSemantic edc:cname="TMP_SENSE" edc:desc="CTMU Temperature Sensor (internal AN11)" edc:when="(field &amp; 0x3F) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="VBATDIV2_SENSE" edc:desc="VBAT/2 (internal AN10)" edc:when="(field &amp; 0x3F) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="1P2V_SENSE" edc:desc="IVref 1.2V (internal AN9)" edc:when="(field &amp; 0x3F) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="BGREF" edc:desc="BandGap Reference (internal AN8)" edc:when="(field &amp; 0x3F) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="AN7" edc:desc="AN7" edc:when="(field &amp; 0x3F) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="AN6" edc:desc="AN6" edc:when="(field &amp; 0x3F) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="AN5" edc:desc="AN5" edc:when="(field &amp; 0x3F) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="AN4" edc:desc="AN4" edc:when="(field &amp; 0x3F) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="AN3" edc:desc="AN3" edc:when="(field &amp; 0x3F) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="AN2" edc:desc="AN2" edc:when="(field &amp; 0x3F) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="AN1" edc:desc="AN1" edc:when="(field &amp; 0x3F) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="AN0" edc:desc="AN0" edc:when="(field &amp; 0x3F) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="GSWTRG" edc:nzwidth="0x1" edc:desc="Global Software Trigger bit">
              <edc:SFRFieldSemantic edc:cname="GSWTRG" edc:desc="Trigger conversion for ADC inputs that have selected the GSWTRG bit as either through the associated TRGSRC bits in the ADCTRGx registers or through the STRGSRC&lt;4:0&gt; bits in the ADCCON1 register the trigger signal" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_GSWTRG" edc:desc="Do not trigger an analog-to-digital conversion" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="GLSWTRG" edc:nzwidth="0x1" edc:desc="Global Level Software Trigger bit">
              <edc:SFRFieldSemantic edc:cname="GLSWTRG" edc:desc="Trigger conversion for ADC inputs that have selected the GLSWTRG bit as the trigger signal" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_GLSWTRG" edc:desc="Do not trigger an analog-to-digital conversion" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RQCNVRT" edc:nzwidth="0x1" edc:desc="Individual ADC Input Conversion Request bit">
              <edc:SFRFieldSemantic edc:cname="IND_TRIGGER" edc:desc="Trigger the conversion of the selected ADC input as specified by the ADINSEL bits" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_TRIGGER" edc:desc="Do not trigger the conversion" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SAMP" edc:nzwidth="0x1" edc:desc="Shared ADC7 Analog Input Sampling Enable bit ">
              <edc:SFRFieldSemantic edc:cname="SAMPLE" edc:desc="The ADC S&amp;H amplifier is sampling" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="HOLD" edc:desc="The ADC S&amp;H amplifier is holding" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="UPDRDY" edc:nzwidth="0x1" edc:desc="ADC Update Ready Status bit">
              <edc:SFRFieldSemantic edc:cname="UPDATE_RDY" edc:desc="ADC SFRs can be updated" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="UPDATE_NOT_RDY" edc:desc="ADC SFRs cannot be updated" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="UPDIEN" edc:nzwidth="0x1" edc:desc="Update Ready Interrupt Enable bit">
              <edc:SFRFieldSemantic edc:cname="INT_ON_UPDATE_RDY" edc:desc="Interrupt will be generated when the UPDRDY bit is set by hardware" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NO_INT_ON_UPDATE_RDY" edc:desc="No interrupt is generated" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TRGSUSP" edc:nzwidth="0x1" edc:desc="Trigger Suspend bit">
              <edc:SFRFieldSemantic edc:cname="TRIG_BLOCKED" edc:desc="Triggers are blocked from starting a new analog-to-digital conversion" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="TRIG_NOT_BLOCKED" edc:desc="Triggers are not blocked" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="VREFSEL" edc:nzwidth="0x3" edc:desc="Voltage Reference Input Selection bits">
              <edc:SFRFieldSemantic edc:cname="AVDD_AVSS" edc:desc="ADC VREFH is AVDD, ADC VREFL is AVSS" edc:when="(field &amp; 0x7) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DIGEN7" edc:nzwidth="0x1" edc:desc="Shared ADC (ADC7) Digital Enable bit"/>
            <edc:SFRFieldDef edc:cname="CONCLKDIV" edc:nzwidth="0x6" edc:desc="Analog-to-Digital Control Clock Divider bits"/>
            <edc:SFRFieldDef edc:cname="ADCSEL" edc:nzwidth="0x2" edc:desc="Analog-to-Digital Clock Source bits">
              <edc:SFRFieldSemantic edc:cname="SYSCLK" edc:desc="SYSCLK" edc:when="(field &amp; 0x3) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="REFCLK3" edc:desc="REFCLK3" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="FRC" edc:desc="FRC" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="PBCLK1" edc:desc="PBCLK1" edc:when="(field &amp; 0x3) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
