Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31032.PIC
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCON3CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44001424"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCON3SET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44001428"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCON3INV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4400142C"/>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x44001430"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCIMCON1" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x44001440">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="SIGN0" edc:nzwidth="0x1" edc:desc="AN0 Signed Data Mode bit">
              <edc:SFRFieldSemantic edc:cname="SIGNED" edc:desc="AN0 is using Signed Data mode" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="UNSIGNED" edc:desc="AN0 is using Unsigned Data mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIFF0" edc:nzwidth="0x1" edc:desc="AN0 Mode bit">
              <edc:SFRFieldSemantic edc:cname="DIFF" edc:desc="Selects AN0 differential input pair as AN0+ and ANN0-" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="AN0 is using Single-ended mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIGN1" edc:nzwidth="0x1" edc:desc="AN1 Signed Data Mode bit">
              <edc:SFRFieldSemantic edc:cname="SIGNED" edc:desc="AN1 is using Signed Data mode" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="UNSIGNED" edc:desc="AN1 is using Unsigned Data mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIFF1" edc:nzwidth="0x1" edc:desc="AN1 Mode bit">
              <edc:SFRFieldSemantic edc:cname="DIFF" edc:desc="Selects AN1 differential input pair as AN1+ and ANN0-" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="AN1 is using Single-ended mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIGN2" edc:nzwidth="0x1" edc:desc="AN2 Signed Data Mode bit">
              <edc:SFRFieldSemantic edc:cname="SIGNED" edc:desc="AN2 is using Signed Data mode" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="UNSIGNED" edc:desc="AN2 is using Unsigned Data mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIFF2" edc:nzwidth="0x1" edc:desc="AN2 Mode bit">
              <edc:SFRFieldSemantic edc:cname="DIFF" edc:desc="Selects AN2 differential input pair as AN2+ and ANN0-" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="AN2 is using Single-ended mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIGN3" edc:nzwidth="0x1" edc:desc="AN3 Signed Data Mode bit">
              <edc:SFRFieldSemantic edc:cname="SIGNED" edc:desc="AN3 is using Signed Data mode" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="UNSIGNED" edc:desc="AN3 is using Unsigned Data mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIFF3" edc:nzwidth="0x1" edc:desc="AN3 Mode bit">
              <edc:SFRFieldSemantic edc:cname="DIFF" edc:desc="Selects AN3 differential input pair as AN3+ and ANN0-" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="AN3 is using Single-ended mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIGN4" edc:nzwidth="0x1" edc:desc="AN4 Signed Data Mode bit">
              <edc:SFRFieldSemantic edc:cname="SIGNED" edc:desc="AN4 is using Signed Data mode" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="UNSIGNED" edc:desc="AN4 is using Unsigned Data mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIFF4" edc:nzwidth="0x1" edc:desc="AN4 Mode bit">
              <edc:SFRFieldSemantic edc:cname="DIFF" edc:desc="Selects AN4 differential input pair as AN4+ and ANN0-" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="AN4 is using Single-ended mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIGN5" edc:nzwidth="0x1" edc:desc="AN5 Signed Data Mode bit">
              <edc:SFRFieldSemantic edc:cname="SIGNED" edc:desc="AN5 is using Signed Data mode" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="UNSIGNED" edc:desc="AN5 is using Unsigned Data mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIFF5" edc:nzwidth="0x1" edc:desc="AN5 Mode bit">
              <edc:SFRFieldSemantic edc:cname="DIFF" edc:desc="Selects AN5 differential input pair as AN5+ and ANN0-" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="AN5 is using Single-ended mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIGN6" edc:nzwidth="0x1" edc:desc="AN6 Signed Data Mode bit">
              <edc:SFRFieldSemantic edc:cname="SIGNED" edc:desc="AN6 is using Signed Data mode" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="UNSIGNED" edc:desc="AN6 is using Unsigned Data mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIFF6" edc:nzwidth="0x1" edc:desc="AN6 Mode bit">
              <edc:SFRFieldSemantic edc:cname="DIFF" edc:desc="Selects AN6 differential input pair as AN6+ and ANN0-" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="AN6 is using Single-ended mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIGN7" edc:nzwidth="0x1" edc:desc="AN7 Signed Data Mode bit">
              <edc:SFRFieldSemantic edc:cname="SIGNED" edc:desc="AN7 is using Signed Data mode" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="UNSIGNED" edc:desc="AN7 is using Unsigned Data mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIFF7" edc:nzwidth="0x1" edc:desc="AN7 Mode bit">
              <edc:SFRFieldSemantic edc:cname="DIFF" edc:desc="Selects AN7 differential input pair as AN7+ and ANN0-" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="AN7 is using Single-ended mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIGN8" edc:nzwidth="0x1" edc:desc="AN8 Signed Data Mode bit">
              <edc:SFRFieldSemantic edc:cname="SIGNED" edc:desc="AN8 is using Signed Data mode" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="UNSIGNED" edc:desc="AN8 is using Unsigned Data mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIFF8" edc:nzwidth="0x1" edc:desc="AN 8 Mode bit">
              <edc:SFRFieldSemantic edc:cname="DIFF" edc:desc="Selects AN8 differential input pair as AN8+ and ANN0-" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="AN8 is using Single-ended mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIGN9" edc:nzwidth="0x1" edc:desc="AN9 Signed Data Mode bit">
              <edc:SFRFieldSemantic edc:cname="SIGNED" edc:desc="AN9 is using Signed Data mode" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="UNSIGNED" edc:desc="AN9 is using Unsigned Data mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIFF9" edc:nzwidth="0x1" edc:desc="AN9 Mode bit">
              <edc:SFRFieldSemantic edc:cname="DIFF" edc:desc="Selects AN9 differential input pair as AN9+ and ANN0-" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="AN9 is using Single-ended mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIGN10" edc:nzwidth="0x1" edc:desc="AN10 Signed Data Mode bit">
              <edc:SFRFieldSemantic edc:cname="SIGNED" edc:desc="AN10 is using Signed Data mode" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="UNSIGNED" edc:desc="AN10 is using Unsigned Data mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIFF10" edc:nzwidth="0x1" edc:desc="AN10 Mode bit">
              <edc:SFRFieldSemantic edc:cname="DIFF" edc:desc="Selects AN10 differential input pair as AN10+ and ANN0-" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="AN10 is using Single-ended mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIGN11" edc:nzwidth="0x1" edc:desc="AN11 Signed Data Mode bit">
              <edc:SFRFieldSemantic edc:cname="SIGNED" edc:desc="AN11 is using Signed Data mode" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="UNSIGNED" edc:desc="AN11 is using Unsigned Data mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIFF11" edc:nzwidth="0x1" edc:desc="AN11 Mode bit">
              <edc:SFRFieldSemantic edc:cname="DIFF" edc:desc="Selects AN11 differential input pair as AN11+ and ANN0-" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="AN11 is using Single-ended mode" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCIMOD1CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44001444"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCIMOD1SET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44001448"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCIMOD1INV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4400144C"/>
      <edc:AdjustPoint edc:offset="0x30" edc:_addr="0x44001450"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCGIRQEN1" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFF" edc:_addr="0x44001480">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="AGIEN0" edc:nzwidth="0x1" edc:desc="ADC Global Interrupt Enable bit">
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Interrupts are disabled" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AGIEN1" edc:nzwidth="0x1" edc:desc="ADC Global Interrupt Enable bit">
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Interrupts are disabled" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AGIEN2" edc:nzwidth="0x1" edc:desc="ADC Global Interrupt Enable bit">
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Interrupts are disabled" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AGIEN3" edc:nzwidth="0x1" edc:desc="ADC Global Interrupt Enable bit">
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Interrupts are disabled" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AGIEN4" edc:nzwidth="0x1" edc:desc="ADC Global Interrupt Enable bit">
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Interrupts are disabled" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AGIEN5" edc:nzwidth="0x1" edc:desc="ADC Global Interrupt Enable bit">
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Interrupts are disabled" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AGIEN6" edc:nzwidth="0x1" edc:desc="ADC Global Interrupt Enable bit">
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Interrupts are disabled" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AGIEN7" edc:nzwidth="0x1" edc:desc="ADC Global Interrupt Enable bit">
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Interrupts are disabled" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AGIEN8" edc:nzwidth="0x1" edc:desc="ADC Global Interrupt Enable bit">
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Interrupts are disabled" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AGIEN9" edc:nzwidth="0x1" edc:desc="ADC Global Interrupt Enable bit">
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Interrupts are disabled" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AGIEN10" edc:nzwidth="0x1" edc:desc="ADC Global Interrupt Enable bit">
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Interrupts are disabled" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AGIEN11" edc:nzwidth="0x1" edc:desc="ADC Global Interrupt Enable bit">
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Interrupts are disabled" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
