Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31032.PIC
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCGIRQEN1CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44001484"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCGIRQEN1SET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44001488"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCGIRQEN1INV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4400148C"/>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x44001490"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCSS1" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFF" edc:_addr="0x440014A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="CSS0" edc:nzwidth="0x1" edc:desc="Analog Common Scan Select bits">
              <edc:SFRFieldSemantic edc:cname="SEL_AN0" edc:desc="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SKIP_AN0" edc:desc="Skip ANx for input scan" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSS1" edc:nzwidth="0x1" edc:desc="Analog Common Scan Select bits">
              <edc:SFRFieldSemantic edc:cname="SEL_AN1" edc:desc="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SKIP_AN1" edc:desc="Skip ANx for input scan" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSS2" edc:nzwidth="0x1" edc:desc="Analog Common Scan Select bits">
              <edc:SFRFieldSemantic edc:cname="SEL_AN2" edc:desc="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SKIP_AN2" edc:desc="Skip ANx for input scan" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSS3" edc:nzwidth="0x1" edc:desc="Analog Common Scan Select bits">
              <edc:SFRFieldSemantic edc:cname="SEL_AN3" edc:desc="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SKIP_AN3" edc:desc="Skip ANx for input scan" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSS4" edc:nzwidth="0x1" edc:desc="Analog Common Scan Select bits">
              <edc:SFRFieldSemantic edc:cname="SEL_AN4" edc:desc="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SKIP_AN4" edc:desc="Skip ANx for input scan" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSS5" edc:nzwidth="0x1" edc:desc="Analog Common Scan Select bits">
              <edc:SFRFieldSemantic edc:cname="SEL_AN5" edc:desc="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SKIP_AN5" edc:desc="Skip ANx for input scan" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSS6" edc:nzwidth="0x1" edc:desc="Analog Common Scan Select bits">
              <edc:SFRFieldSemantic edc:cname="SEL_AN6" edc:desc="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SKIP_AN6" edc:desc="Skip ANx for input scan" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSS7" edc:nzwidth="0x1" edc:desc="Analog Common Scan Select bits">
              <edc:SFRFieldSemantic edc:cname="SEL_AN7" edc:desc="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SKIP_AN7" edc:desc="Skip ANx for input scan" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSS8" edc:nzwidth="0x1" edc:desc="Analog Common Scan Select bits">
              <edc:SFRFieldSemantic edc:cname="SEL_AN8" edc:desc="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SKIP_AN8" edc:desc="Skip ANx for input scan" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSS9" edc:nzwidth="0x1" edc:desc="Analog Common Scan Select bits">
              <edc:SFRFieldSemantic edc:cname="SEL_AN9" edc:desc="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SKIP_AN9" edc:desc="Skip ANx for input scan" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSS10" edc:nzwidth="0x1" edc:desc="Analog Common Scan Select bits">
              <edc:SFRFieldSemantic edc:cname="SEL_AN10" edc:desc="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SKIP_AN10" edc:desc="Skip ANx for input scan" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSS11" edc:nzwidth="0x1" edc:desc="Analog Common Scan Select bits">
              <edc:SFRFieldSemantic edc:cname="SEL_AN11" edc:desc="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SKIP_AN11" edc:desc="Skip ANx for input scan" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCSS1CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440014A4"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCSS1SET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440014A8"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCSS1INV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x440014AC"/>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x440014B0"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCDSTAT1" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFF" edc:_addr="0x440014C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="ARDY0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY11" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
