Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31032.PIC
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCTRG1CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44001604"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCTRG1SET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44001608"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCTRG1INV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4400160C"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCTRG2" edc:nzwidth="0x20" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1F1F1F1F" edc:_addr="0x44001610">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="TRGSRC4" edc:nzwidth="0x5" edc:desc="Trigger Source for Conversion of ADC4 Module Select bits">
              <edc:SFRFieldSemantic edc:cname="RESERVED" edc:desc="RESERVED" edc:when="(field &amp; 0x1F) == 0x1F"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_47" edc:desc="ADC_TRIG_16" edc:when="(field &amp; 0x1F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_46" edc:desc="ADC_TRIG_15" edc:when="(field &amp; 0x1F) == 0x0F"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_45" edc:desc="ADC_TRIG_14" edc:when="(field &amp; 0x1F) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_44" edc:desc="ADC_TRIG_13" edc:when="(field &amp; 0x1F) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_43" edc:desc="ADC_TRIG_12" edc:when="(field &amp; 0x1F) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_42" edc:desc="ADC_TRIG_11" edc:when="(field &amp; 0x1F) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_41" edc:desc="ADC_TRIG_10" edc:when="(field &amp; 0x1F) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_40" edc:desc="ADC_TRIG_9" edc:when="(field &amp; 0x1F) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_39" edc:desc="ADC_TRIG_8" edc:when="(field &amp; 0x1F) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_38" edc:desc="ADC_TRIG_7" edc:when="(field &amp; 0x1F) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_37" edc:desc="ADC_TRIG_6" edc:when="(field &amp; 0x1F) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_36" edc:desc="ADC_TRIG_5" edc:when="(field &amp; 0x1F) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="INT0" edc:desc="INT0" edc:when="(field &amp; 0x1F) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="SCAN_TRIG" edc:desc="Scan trigger" edc:when="(field &amp; 0x1F) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="SW_LVL" edc:desc="Software level trigger" edc:when="(field &amp; 0x1F) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SW_EDGE" edc:desc="Software edge trigger" edc:when="(field &amp; 0x1F) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Trigger" edc:when="(field &amp; 0x1F) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TRGSRC5" edc:nzwidth="0x5" edc:desc="Trigger Source for Conversion of ADC5 Module Select bits">
              <edc:SFRFieldSemantic edc:cname="RESERVED" edc:desc="RESERVED" edc:when="(field &amp; 0x1F) == 0x1F"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_47" edc:desc="ADC_TRIG_16" edc:when="(field &amp; 0x1F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_46" edc:desc="ADC_TRIG_15" edc:when="(field &amp; 0x1F) == 0x0F"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_45" edc:desc="ADC_TRIG_14" edc:when="(field &amp; 0x1F) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_44" edc:desc="ADC_TRIG_13" edc:when="(field &amp; 0x1F) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_43" edc:desc="ADC_TRIG_12" edc:when="(field &amp; 0x1F) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_42" edc:desc="ADC_TRIG_11" edc:when="(field &amp; 0x1F) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_41" edc:desc="ADC_TRIG_10" edc:when="(field &amp; 0x1F) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_40" edc:desc="ADC_TRIG_9" edc:when="(field &amp; 0x1F) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_39" edc:desc="ADC_TRIG_8" edc:when="(field &amp; 0x1F) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_38" edc:desc="ADC_TRIG_7" edc:when="(field &amp; 0x1F) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_37" edc:desc="ADC_TRIG_6" edc:when="(field &amp; 0x1F) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_36" edc:desc="ADC_TRIG_5" edc:when="(field &amp; 0x1F) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="INT0" edc:desc="INT0" edc:when="(field &amp; 0x1F) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="SCAN_TRIG" edc:desc="Scan trigger" edc:when="(field &amp; 0x1F) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="SW_LVL" edc:desc="Software level trigger" edc:when="(field &amp; 0x1F) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SW_EDGE" edc:desc="Software edge trigger" edc:when="(field &amp; 0x1F) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Trigger" edc:when="(field &amp; 0x1F) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TRGSRC6" edc:nzwidth="0x5" edc:desc="Trigger Source for Conversion of ADC6 Module Select bits">
              <edc:SFRFieldSemantic edc:cname="RESERVED" edc:desc="RESERVED" edc:when="(field &amp; 0x1F) == 0x1F"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_47" edc:desc="ADC_TRIG_16" edc:when="(field &amp; 0x1F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_46" edc:desc="ADC_TRIG_15" edc:when="(field &amp; 0x1F) == 0x0F"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_45" edc:desc="ADC_TRIG_14" edc:when="(field &amp; 0x1F) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_44" edc:desc="ADC_TRIG_13" edc:when="(field &amp; 0x1F) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_43" edc:desc="ADC_TRIG_12" edc:when="(field &amp; 0x1F) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_42" edc:desc="ADC_TRIG_11" edc:when="(field &amp; 0x1F) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_41" edc:desc="ADC_TRIG_10" edc:when="(field &amp; 0x1F) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_40" edc:desc="ADC_TRIG_9" edc:when="(field &amp; 0x1F) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_39" edc:desc="ADC_TRIG_8" edc:when="(field &amp; 0x1F) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_38" edc:desc="ADC_TRIG_7" edc:when="(field &amp; 0x1F) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_37" edc:desc="ADC_TRIG_6" edc:when="(field &amp; 0x1F) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_36" edc:desc="ADC_TRIG_5" edc:when="(field &amp; 0x1F) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="INT0" edc:desc="INT0" edc:when="(field &amp; 0x1F) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="SCAN_TRIG" edc:desc="Scan trigger" edc:when="(field &amp; 0x1F) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="SW_LVL" edc:desc="Software level trigger" edc:when="(field &amp; 0x1F) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SW_EDGE" edc:desc="Software edge trigger" edc:when="(field &amp; 0x1F) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Trigger" edc:when="(field &amp; 0x1F) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TRGSRC7" edc:nzwidth="0x5" edc:desc="Trigger Source for Conversion of ADC7 Module Select bits">
              <edc:SFRFieldSemantic edc:cname="RESERVED" edc:desc="RESERVED" edc:when="(field &amp; 0x1F) == 0x1F"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_47" edc:desc="ADC_TRIG_16" edc:when="(field &amp; 0x1F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_46" edc:desc="ADC_TRIG_15" edc:when="(field &amp; 0x1F) == 0x0F"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_45" edc:desc="ADC_TRIG_14" edc:when="(field &amp; 0x1F) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_44" edc:desc="ADC_TRIG_13" edc:when="(field &amp; 0x1F) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_43" edc:desc="ADC_TRIG_12" edc:when="(field &amp; 0x1F) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_42" edc:desc="ADC_TRIG_11" edc:when="(field &amp; 0x1F) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_41" edc:desc="ADC_TRIG_10" edc:when="(field &amp; 0x1F) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_40" edc:desc="ADC_TRIG_9" edc:when="(field &amp; 0x1F) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_39" edc:desc="ADC_TRIG_8" edc:when="(field &amp; 0x1F) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_38" edc:desc="ADC_TRIG_7" edc:when="(field &amp; 0x1F) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_37" edc:desc="ADC_TRIG_6" edc:when="(field &amp; 0x1F) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_36" edc:desc="ADC_TRIG_5" edc:when="(field &amp; 0x1F) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="INT0" edc:desc="INT0" edc:when="(field &amp; 0x1F) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="SCAN_TRIG" edc:desc="Scan trigger" edc:when="(field &amp; 0x1F) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="SW_LVL" edc:desc="Software level trigger" edc:when="(field &amp; 0x1F) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SW_EDGE" edc:desc="Software edge trigger" edc:when="(field &amp; 0x1F) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Trigger" edc:when="(field &amp; 0x1F) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADTRG2CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44001614"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADTRG2SET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44001618"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADTRG2INV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4400161C"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x44001620"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADTRG3CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44001624"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADTRG3SET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44001628"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADTRG3INV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4400162C"/>
      <edc:AdjustPoint edc:offset="0x50" edc:_addr="0x44001630"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCMPCON1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn--nnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF3FFF" edc:_addr="0x44001680">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="IELOLO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IELOHI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IEHILO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IEHIHI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IEBTWN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCMPED" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCMPIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDCMP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPINID0" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CVD_DATA" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCMPCON1CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44001684"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCMPCON1SET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44001688"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCMPCON1INV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4400168C"/>
      <edc:SFRDef ltx:memberofperipheral="ADCHS" edc:cname="ADCCMPCON2" edc:nzwidth="0x20" edc:access="-------------------nnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1FFF" edc:_addr="0x44001690">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="IELOLO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IELOHI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IEHILO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IEHIHI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IEBTWN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCMPED" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCMPGIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDCMP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AINID" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
