Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31032.PIC
      <edc:AdjustPoint edc:offset="0xC0" edc:_addr="0x44002540"/>
      <edc:SFRDef ltx:memberofperipheral="CVD" edc:cname="CVDBG" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002600">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CVD">
            <edc:SFRFieldDef edc:cname="SEL_L" edc:nzwidth="0x10" edc:desc="Select signal to MUX debug signals on to port cvd_tst_dbg_data[15:0]"/>
            <edc:SFRFieldDef edc:cname="SEL_H" edc:nzwidth="0x10" edc:desc="Select signal to MUX debug signals on to port cvd_tst_dbg_data[31:16]"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3FC" edc:_addr="0x44002604"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="ANSEL" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnn---" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F8" edc:_addr="0x44002A00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ANS3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS10" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="ANSELCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A04"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="ANSELSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A08"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="ANSELINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A0C"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="TRIS" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnn---" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F8" edc:_addr="0x44002A10">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TRIS3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS10" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="TRISCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A14"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="TRISSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A18"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="TRISINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A1C"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="PORT" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnn---" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F8" edc:_addr="0x44002A20">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="R3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R10" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="PORTCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A24"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="PORTSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A28"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="PORTINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A2C"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="LAT" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnn---" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F8" edc:_addr="0x44002A30">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="LAT3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT10" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="LATCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A34"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="LATSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A38"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="LATINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A3C"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="ODC" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnn---" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F8" edc:_addr="0x44002A40">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ODC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC10" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="ODCCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A44"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="ODCSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A48"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="ODCINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A4C"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNPU" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnn---" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F8" edc:_addr="0x44002A50">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CNPU3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU10" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNPUCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A54"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNPUSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A58"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNPUINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A5C"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNPD" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnn---" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F8" edc:_addr="0x44002A60">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CNPD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD10" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
