Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31032.PIC
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNPDCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A64"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNPDSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A68"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNPDINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A6C"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNCON" edc:nzwidth="0x20" edc:access="----------------nnn-n-----------" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xE800" edc:_addr="0x44002A70">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNCONCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A74"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNCONSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A78"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNCONINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A7C"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNEN" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnn---" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F8" edc:_addr="0x44002A80">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CNIE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE10" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNENCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A84"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNENSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A88"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNENINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A8C"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNSTAT" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnn---" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F8" edc:_addr="0x44002A90">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CNSTAT3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT10" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNSTATCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A94"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNSTATSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A98"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNSTATINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002A9C"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNNE" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnn---" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F8" edc:_addr="0x44002AA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CNNE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE10" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNNECLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002AA4"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNNESET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002AA8"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNNEINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002AAC"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNF" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnn---" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F8" edc:_addr="0x44002AB0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CNF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF10" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNFCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002AB4"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNFSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002AB8"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="CNFINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002ABC"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="SRCON0" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnn---" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F8" edc:_addr="0x44002AC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SR03" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR04" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR05" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR06" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR07" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR08" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR09" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR010" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="SRCON0CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002AC4"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="SRCON0SET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002AC8"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="SRCON0INV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002ACC"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="SRCON1" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnn---" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F8" edc:_addr="0x44002AD0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SR13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR110" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
