Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31032.PIC
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="SRCON1CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002AD4"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="SRCON1SET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002AD8"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOA" edc:cname="SRCON1INV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002ADC"/>
      <edc:AdjustPoint edc:offset="0x20" edc:_addr="0x44002AE0"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="ANSEL" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnn---" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F8" edc:_addr="0x44002B00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOB">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ANS3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS10" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="ANSELCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B04"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="ANSELSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B08"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="ANSELINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B0C"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="TRIS" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnn---" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F8" edc:_addr="0x44002B10">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOB">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TRIS3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS10" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="TRISCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B14"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="TRISSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B18"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="TRISINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B1C"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="PORT" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnn---" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F8" edc:_addr="0x44002B20">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOB">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="R3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R10" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="PORTCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B24"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="PORTSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B28"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="PORTINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B2C"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="LAT" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnn---" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F8" edc:_addr="0x44002B30">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOB">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="LAT3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT10" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="LATCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B34"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="LATSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B38"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="LATINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B3C"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="ODC" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnn---" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F8" edc:_addr="0x44002B40">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOB">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ODC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC10" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
