Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31032.PIC
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="ODCCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B44"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="ODCSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B48"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="ODCINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B4C"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="CNPU" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnn---" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F8" edc:_addr="0x44002B50">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOB">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CNPU3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU10" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="CNPUCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B54"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="CNPUSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B58"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="CNPUINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B5C"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="CNPD" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnn---" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F8" edc:_addr="0x44002B60">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOB">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CNPD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD10" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="CNPDCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B64"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="CNPDSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B68"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="CNPDINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B6C"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="CNCON" edc:nzwidth="0x20" edc:access="----------------nnn-n-----------" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xE800" edc:_addr="0x44002B70">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOB">
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="CNCONCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B74"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="CNCONSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B78"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="CNCONINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B7C"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="CNEN" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnn---" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F8" edc:_addr="0x44002B80">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOB">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CNIE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE10" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="CNENCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B84"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="CNENSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B88"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="CNENINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B8C"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="CNSTAT" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnn---" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F8" edc:_addr="0x44002B90">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOB">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CNSTAT3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT10" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="CNSTATCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B94"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="CNSTATSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B98"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="CNSTATINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002B9C"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="CNNE" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnn---" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F8" edc:_addr="0x44002BA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOB">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CNNE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE10" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="CNNECLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002BA4"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="CNNESET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002BA8"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="CNNEINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002BAC"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="CNF" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnn---" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F8" edc:_addr="0x44002BB0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOB">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CNF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF10" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="CNFCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002BB4"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="CNFSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002BB8"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="CNFINV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002BBC"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="SRCON0" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnn---" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F8" edc:_addr="0x44002BC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOB">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SR03" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR04" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR05" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR06" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR07" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR08" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR09" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR010" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="SRCON0CLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002BC4"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="SRCON0SET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002BC8"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="SRCON0INV" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44002BCC"/>
      <edc:SFRDef ltx:memberofperipheral="GPIOB" edc:cname="SRCON1" edc:nzwidth="0x20" edc:access="---------------------nnnnnnnn---" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F8" edc:_addr="0x44002BD0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOB">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SR13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR110" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
