Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31032.PIC
      <edc:SFRDef ltx:memberofperipheral="ROT" edc:cname="EFUSE_RWDATA" edc:nzwidth="0x20" edc:access="----nnnnnnnnnnnn--------nnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFF00FF" edc:_addr="0x44003804">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ROT">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x8" edc:desc="eFuse Program (Write) Data"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0xC" edc:desc="eFuse Program/Read Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ROT" edc:cname="EFUSE_CON" edc:nzwidth="0x20" edc:access="------------------------nnn---nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xE3" edc:_addr="0x44003808">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ROT">
            <edc:SFRFieldDef edc:cname="PGM_1BIT" edc:nzwidth="0x1" edc:desc="eFuse CTRL to program 1 bit at a time. Valid only when EN_PGM is set">
              <edc:SFRFieldSemantic edc:cname="EFUSE_RW_15_0" edc:desc="EFuse controller will program EFUSE_RWDATA.DATA[15:0] to the address in EFUSE_RWDATA.ADDR[11:3]" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="EFUSE_RW_0" edc:desc="EFuse controller will program EFUSE_RWDATA.DATA[0] to the address in EFUSE_RWDATA.ADDR[11:0]" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PGM_MODE" edc:nzwidth="0x1" edc:desc="eFuse Programming Mode Enable bit">
              <edc:SFRFieldSemantic edc:cname="PGM_MODE_DISABLED" edc:desc="EFuse Programming disabled" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PGM_MODE_ENABLED" edc:desc="EFuse Programming enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EN_LD" edc:nzwidth="0x1" edc:desc="eFuse Word Read Start bit for loading the fuse byte pointed by ADDR field into the holding register">
              <edc:SFRFieldSemantic edc:cname="ENLD_READ_COMPLETED" edc:desc="EFuse Read operation has completed" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENLD_READ_START" edc:desc="Start eFuse Read operation for specified eFuse word as addressed in EFUSE_RWDATA register" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EN_LD_ALL1" edc:nzwidth="0x1" edc:desc="eFuse Panel Read Start bit for loading into the holding registers">
              <edc:SFRFieldSemantic edc:cname="ENLD_ALL1_READ_COMPLETED" edc:desc="EFuse Read operation has completed" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENLD_ALL1_READ_START" edc:desc="Start eFuse Read operation for entire eFuse panel" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EN_PGM" edc:nzwidth="0x1" edc:desc="eFuse Programming Start bit">
              <edc:SFRFieldSemantic edc:cname="EN_PGM_COMPLETED" edc:desc="EFuse Programming operation has completed" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="EN_PGM_START" edc:desc="Start eFuse Programming operation" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3F4" edc:_addr="0x4400380C"/>
      <edc:SFRDef ltx:memberofperipheral="DAC_CTRL" edc:cname="DACCON" edc:nzwidth="0x20" edc:access="----------------n-------nnn-----" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x80E0" edc:_addr="0x44003C00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC_CTRL">
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="LPRCEN1" edc:nzwidth="0x1" edc:desc="LPRC clock enabled for SnH mode">
              <edc:SFRFieldSemantic edc:cname="LPRC_ENABLE" edc:desc="LPRC clock not enabled" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LPRC_DISABLE" edc:desc="LPRC clock enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="OUTEN" edc:nzwidth="0x1" edc:desc="Will enable the output buffer">
              <edc:SFRFieldSemantic edc:cname="OUTEN_DISABLE" edc:desc="Output buffer disabled" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="OUTEN_ENABLE" edc:desc="Output buffer enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SNH" edc:nzwidth="0x1" edc:desc="Sample and hold circuitry">
              <edc:SFRFieldSemantic edc:cname="SNH_NORMAL" edc:desc="DAC operation in normal mode" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SNH_LOWPOWER" edc:desc="DAC operation in low power mode" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="EN" edc:nzwidth="0x1" edc:desc="Enable">
              <edc:SFRFieldSemantic edc:cname="DAC_DISABLE" edc:desc="The peripheral is disabled." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DAC_ENABLE" edc:desc="The peripheral is enabled." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC_CTRL" edc:cname="DACCODE" edc:nzwidth="0x20" edc:access="-------------------------nnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7F" edc:_addr="0x44003C04">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC_CTRL">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x7" edc:desc="DAC data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC_CTRL" edc:cname="DACCON2" edc:nzwidth="0x20" edc:access="nnn---nnnnnnnnnn------nnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xE3FF03FF" edc:_addr="0x44003C08">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC_CTRL">
            <edc:SFRFieldDef edc:cname="WIDTH" edc:nzwidth="0xA" edc:desc="SnH clock width"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="PERIOD" edc:nzwidth="0xA" edc:desc="SnH clock period"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PRESCALAR" edc:nzwidth="0x3" edc:desc="Prescaling factor for SnH clock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
