Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31032.PIC
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44003E04"/>
      <edc:SFRDef ltx:memberofperipheral="DGI_SPI" edc:cname="SPISTAT" edc:nzwidth="0x20" edc:access="-----------rrrrr----r---r---r-r-" edc:por="00000000000000000000000000001000" edc:mclr="00000000000000000000000000001000" edc:impl="0x1F088A" edc:_addr="0x44003E10">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DGI_SPI">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SPITBF" edc:nzwidth="0x1" edc:desc="SPI Transmit Buffer Full Status bit">
              <edc:SFRFieldSemantic edc:cname="TXB_NOT_FULL" edc:desc="SPIxTXB not full" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TXB_FULL" edc:desc="SPIxTXB is full" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SPITBE" edc:nzwidth="0x1" edc:desc="SPI Transmit Buffer Empty status bit">
              <edc:SFRFieldSemantic edc:cname="TXB_NOT_EMPTY" edc:desc="SPIxTXB is not empty" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TXB_EMPTY" edc:desc="SPIxTXB is empty" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SRMT" edc:nzwidth="0x1" edc:desc="Shift Register (SPIxSR) Empty bit0= There are current or pending transactions">
              <edc:SFRFieldSemantic edc:cname="SRMT_NO_TRANS" edc:desc="There are no current or pending transactions" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SPIBUSY" edc:nzwidth="0x1" edc:desc="SPI activity status bit">
              <edc:SFRFieldSemantic edc:cname="SPI_FREE" edc:desc="No on-going transactions (at time of read)" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SPI_BUSY" edc:desc="Macro currently busy with some transactions" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TXBUFELM" edc:nzwidth="0x5" edc:desc="TransmitBuffer Element Count bits (valid only when ENHBUF = 1)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44003E14"/>
      <edc:SFRDef ltx:memberofperipheral="DGI_SPI" edc:cname="SPIBUF" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x44003E20">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DGI_SPI">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="FIFO Data bits"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44003E24"/>
      <edc:SFRDef ltx:memberofperipheral="DGI_SPI" edc:cname="SPIBRG" edc:nzwidth="0x20" edc:access="-------------------nnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1FFF" edc:_addr="0x44003E30">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DGI_SPI">
            <edc:SFRFieldDef edc:cname="BRG" edc:nzwidth="0xD" edc:desc="Baud Rate Divisor bitsseeSection 2.4.1."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44003E34"/>
      <edc:SFRDef ltx:memberofperipheral="DGI_SPI" edc:cname="SPITXADD" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x44003E40">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DGI_SPI">
            <edc:SFRFieldDef edc:cname="TXADD" edc:nzwidth="0x10" edc:desc="Transmit Source Address bitsTXADD can constantly be updated to reflect the current transmit address as the transfer progresses"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44003E44"/>
      <edc:SFRDef ltx:memberofperipheral="DGI_SPI" edc:cname="SPITXCNT" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x44003E50">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DGI_SPI">
            <edc:SFRFieldDef edc:cname="TXCNT" edc:nzwidth="0x10" edc:desc="Transmit Count bitsThis register indicates the number of transferred data words. As the DMA progresses, TXCNT is constantly decremented to reflect the remaining count yet to be transferred."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xE5AC" edc:_addr="0x44003E54"/>
      <edc:SFRDef ltx:memberofperipheral="PCHE" edc:cname="CHECON" edc:nzwidth="0x20" edc:access="-----nnn-nnn-nnn---n---nn-nnnnnn" edc:por="00000111000000000000000100001111" edc:mclr="00000111000000000000000100001111" edc:impl="0x77711BF" edc:_addr="0x44012400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PCHE">
            <edc:SFRFieldDef edc:cname="PFMWS" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PREFEN" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PFMSECEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADRWS" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CHEPERF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ICHECOH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCHECOH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACHECOH" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ICHEINV" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCHEINV" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACHEINV" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ICHEEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCHEEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACHEEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
