Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31032.PIC
      <edc:SFRDef ltx:memberofperipheral="PMU" edc:cname="CLKCTRL" edc:nzwidth="0x20" edc:access="--nnnn-nnnnn-nnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000101000010000010" edc:mclr="00000000000000000101000010000010" edc:impl="0x3DF7FFFF" edc:_addr="0x44013E08">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="SPICLKDIV" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="PMUANA_BKBOREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPISRC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUCKCLKDIV" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="BUCKSRC" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="BACWD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MLDOEXTEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MVREFFSMEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP_CYCLE" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="BKCLK_HW_OVR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MLDOEXT_BOREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCBOREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUCKBOREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F_BCLK_CFG" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMU" edc:cname="MODECTRL1" edc:nzwidth="0x20" edc:access="nnnnnnnn---nnnnn---nnnnn---nnnnn" edc:por="10000000000000000000000000000000" edc:mclr="10000000000000000000000000000000" edc:impl="0xFF1F1F1F" edc:_addr="0x44013E0C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="VREG4CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG3CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG2CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG1CTRL" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="BUCKMODE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MLDOEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUCKEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMU" edc:cname="MODECTRL2" edc:nzwidth="0x20" edc:access="nnnnnnnn---nnnnn---nnnnn---nnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF1F1F1F" edc:_addr="0x44013E10">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="VREG4CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG3CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG2CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG1CTRL" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="BUCKMODE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MLDOEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUCKEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMU" edc:cname="MODECTRL3" edc:nzwidth="0x20" edc:access="nnnnnnnn---nnnnn---nnnnn---nnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF1F1F1F" edc:_addr="0x44013E14">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="VREG4CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG3CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG2CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG1CTRL" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="BUCKMODE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MLDOEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUCKEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMU" edc:cname="MODECTRL4" edc:nzwidth="0x20" edc:access="nnnnnnnn---nnnnn---nnnnn---nnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF1F1F1F" edc:_addr="0x44013E18">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="VREG4CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG3CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG2CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG1CTRL" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="BUCKMODE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MLDOEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUCKEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMU" edc:cname="OVERCTRL" edc:nzwidth="0x20" edc:access="nnnnnnnnnn-nnnnn---nnnnn---nnnnn" edc:por="10000000010000000000000000000000" edc:mclr="10000000010000000000000000000000" edc:impl="0xFFDF1F1F" edc:_addr="0x44013E1C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMU">
            <edc:SFRFieldDef edc:cname="VREG4OCTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG3OCTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG2OCTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PHWC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVEREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VREG1OCTRL" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="OBUCKMODE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OMLDOEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OBUCKEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
