Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/edc/PIC32CX5109BZ31032.PIC
      <edc:SFRDef ltx:memberofperipheral="TC7" edc:cname="CCBUF1" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:addr="0x40003032">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC7">
            <edc:SFRFieldDef edc:cname="CCBUF" edc:nzwidth="0x10" edc:desc="Counter/Compare Buffer Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:RegisterMap>
    <edc:RegisterMap edc:id="TC7/COUNT32">
      <edc:SFRDef ltx:memberofperipheral="TC7" edc:cname="COUNT" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:addr="0x40003014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC7">
            <edc:SFRFieldDef edc:cname="COUNT" edc:nzwidth="0x20" edc:desc="Counter Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC7" edc:cname="CC0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:addr="0x4000301C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC7">
            <edc:SFRFieldDef edc:cname="CC" edc:nzwidth="0x20" edc:desc="Counter/Compare Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC7" edc:cname="CC1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:addr="0x40003020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC7">
            <edc:SFRFieldDef edc:cname="CC" edc:nzwidth="0x20" edc:desc="Counter/Compare Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC7" edc:cname="CCBUF0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:addr="0x40003030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC7">
            <edc:SFRFieldDef edc:cname="CCBUF" edc:nzwidth="0x20" edc:desc="Counter/Compare Buffer Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC7" edc:cname="CCBUF1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:addr="0x40003034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC7">
            <edc:SFRFieldDef edc:cname="CCBUF" edc:nzwidth="0x20" edc:desc="Counter/Compare Buffer Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:RegisterMap>
    <edc:EmulatorSector edc:beginaddr="0xE0001000" edc:endaddr="0xE000F000" edc:regionid="emulation"/>
  </edc:PhysicalSpace>
  <edc:PinList edc:ppsflavor="atmel">
    <edc:Pin>
      <edc:VirtualPin edc:name="VPMU_VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA5"/>
      <edc:VirtualPin edc:name="IOCA5" edc:ppsfunction="CHANGE_NOTIFICATION" ltx:memberofperipheral="GPIOA"/>
      <edc:VirtualPin edc:name="CMP0" edc:ppsfunction="COMPARATOR__DIGITAL" ltx:memberofperipheral="AC"/>
      <edc:VirtualPin edc:name="CMPTRDY" edc:ppsfunction="COMPARATOR__DIGITAL" ltx:memberofperipheral="AC"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="MSSP_SPI_I2C" ltx:memberofperipheral="SERCOM0"/>
      <edc:VirtualPin edc:name="RA5" edc:ppsfunction="PORT_I_O" ltx:memberofperipheral="GPIOA"/>
      <edc:VirtualPin edc:name="RPA5" edc:ppsfunction="PPS" ltx:memberofperipheral="PPS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA6"/>
      <edc:VirtualPin edc:name="IOCA6" edc:ppsfunction="CHANGE_NOTIFICATION" ltx:memberofperipheral="GPIOA"/>
      <edc:VirtualPin edc:name="CMPTEN" edc:ppsfunction="COMPARATOR__DIGITAL" ltx:memberofperipheral="AC"/>
      <edc:VirtualPin edc:name="AC_CMP1_ALT" edc:ppsfunction="COMPARATOR__DIGITAL" ltx:memberofperipheral="BTZBSYS"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="MSSP_SPI_I2C" ltx:memberofperipheral="SERCOM0"/>
      <edc:VirtualPin edc:name="RA6" edc:ppsfunction="PORT_I_O" ltx:memberofperipheral="GPIOA"/>
      <edc:VirtualPin edc:name="RPA6" edc:ppsfunction="PPS" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="TA4D_ALT" edc:ppsfunction="TEST_MODES" ltx:memberofperipheral="BTZBSYS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA7"/>
      <edc:VirtualPin edc:name="IOCA7" edc:ppsfunction="CHANGE_NOTIFICATION" ltx:memberofperipheral="GPIOA"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="MSSP_SPI_I2C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="RA7" edc:ppsfunction="PORT_I_O" ltx:memberofperipheral="GPIOA"/>
      <edc:VirtualPin edc:name="RPA7" edc:ppsfunction="PPS" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="PMU_TEST_SCK" edc:ppsfunction="RF__DIGITAL" ltx:memberofperipheral="PMU"/>
      <edc:VirtualPin edc:name="ADCSVCLKI" edc:ppsfunction="SILICON_VALIDATION__DFT_" ltx:memberofperipheral="ADCHS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA8"/>
      <edc:VirtualPin edc:name="IOCA8" edc:ppsfunction="CHANGE_NOTIFICATION" ltx:memberofperipheral="GPIOA"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="MSSP_SPI_I2C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="RA8" edc:ppsfunction="PORT_I_O" ltx:memberofperipheral="GPIOA"/>
      <edc:VirtualPin edc:name="RPA8" edc:ppsfunction="PPS" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="FECTRL0" edc:ppsfunction="RF__DIGITAL" ltx:memberofperipheral="BTZBSYS"/>
      <edc:VirtualPin edc:name="PMU_TEST_SDI" edc:ppsfunction="RF__DIGITAL" ltx:memberofperipheral="PMU"/>
      <edc:VirtualPin edc:name="ADCSVTRG" edc:ppsfunction="SILICON_VALIDATION__DFT_" ltx:memberofperipheral="ADCHS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA9"/>
      <edc:VirtualPin edc:name="IOCA9" edc:ppsfunction="CHANGE_NOTIFICATION" ltx:memberofperipheral="GPIOA"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="MSSP_SPI_I2C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="RA9" edc:ppsfunction="PORT_I_O" ltx:memberofperipheral="GPIOA"/>
      <edc:VirtualPin edc:name="RPA9" edc:ppsfunction="PPS" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="FECTRL1" edc:ppsfunction="RF__DIGITAL" ltx:memberofperipheral="BTZBSYS"/>
      <edc:VirtualPin edc:name="PMU_TEST_CS" edc:ppsfunction="RF__DIGITAL" ltx:memberofperipheral="PMU"/>
      <edc:VirtualPin edc:name="RTC_IN0_ALT" edc:ppsfunction="RTCC" ltx:memberofperipheral="BTZBSYS"/>
      <edc:VirtualPin edc:name="IN0_ALT" edc:ppsfunction="RTCC" ltx:memberofperipheral="RTC"/>
      <edc:VirtualPin edc:name="ADCSVFRM" edc:ppsfunction="SILICON_VALIDATION__DFT_" ltx:memberofperipheral="ADCHS"/>
      <edc:VirtualPin edc:name="DGI_SDO" edc:ppsfunction="SPI" ltx:memberofperipheral="DGI_SPI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA10"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="10" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IN3" edc:ppsfunction="10" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="10" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="2" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="NMI" edc:ppsfunction="2" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="OUT1" edc:ppsfunction="27" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="IOCA10" edc:ppsfunction="CHANGE_NOTIFICATION" ltx:memberofperipheral="GPIOA"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="MSSP_SPI_I2C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="RA10" edc:ppsfunction="PORT_I_O" ltx:memberofperipheral="GPIOA"/>
      <edc:VirtualPin edc:name="RPA10" edc:ppsfunction="PPS" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="FECTRL2" edc:ppsfunction="RF__DIGITAL" ltx:memberofperipheral="BTZBSYS"/>
      <edc:VirtualPin edc:name="PMU_TEST_SDO" edc:ppsfunction="RF__DIGITAL" ltx:memberofperipheral="PMU"/>
      <edc:VirtualPin edc:name="RTC_OUT_ALT" edc:ppsfunction="RTCC" ltx:memberofperipheral="BTZBSYS"/>
      <edc:VirtualPin edc:name="OUT_ALT" edc:ppsfunction="RTCC" ltx:memberofperipheral="RTC"/>
      <edc:VirtualPin edc:name="ADCSVSARCLK" edc:ppsfunction="SILICON_VALIDATION__DFT_" ltx:memberofperipheral="ADCHS"/>
      <edc:VirtualPin edc:name="DGI_SCK" edc:ppsfunction="SPI" ltx:memberofperipheral="DGI_SPI"/>
      <edc:VirtualPin edc:name="MBISTCLK" edc:ppsfunction="TEST_MODES" ltx:memberofperipheral="BTZBSYS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB9"/>
      <edc:VirtualPin edc:name="IOCB9" edc:ppsfunction="CHANGE_NOTIFICATION" ltx:memberofperipheral="GPIOB"/>
      <edc:VirtualPin edc:name="INT0" edc:ppsfunction="EDGE_INTERRUPT" ltx:memberofperipheral="PMU"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="MSSP_SPI_I2C" ltx:memberofperipheral="SERCOM0"/>
      <edc:VirtualPin edc:name="RB9" edc:ppsfunction="PORT_I_O" ltx:memberofperipheral="GPIOB"/>
      <edc:VirtualPin edc:name="RPB9" edc:ppsfunction="PPS" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="FEM_PD_EXT_PA" edc:ppsfunction="RF__ANALOG" ltx:memberofperipheral="BTZBSYS"/>
      <edc:VirtualPin edc:name="TP3" edc:ppsfunction="RF__ANALOG" ltx:memberofperipheral="BTZBSYS"/>
      <edc:VirtualPin edc:name="ADCSVSOUT" edc:ppsfunction="SILICON_VALIDATION__DFT_" ltx:memberofperipheral="ADCHS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB8"/>
      <edc:VirtualPin edc:name="IOCB8" edc:ppsfunction="CHANGE_NOTIFICATION" ltx:memberofperipheral="GPIOB"/>
      <edc:VirtualPin edc:name="RB8" edc:ppsfunction="PORT_I_O" ltx:memberofperipheral="GPIOB"/>
      <edc:VirtualPin edc:name="RPB8" edc:ppsfunction="PPS" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="TP2" edc:ppsfunction="RF__ANALOG" ltx:memberofperipheral="BTZBSYS"/>
      <edc:VirtualPin edc:name="TP6" edc:ppsfunction="RF__ANALOG" ltx:memberofperipheral="BTZBSYS"/>
      <edc:VirtualPin edc:name="PMU_TEST_SCKO" edc:ppsfunction="RF__DIGITAL" ltx:memberofperipheral="PMU"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA4"/>
      <edc:VirtualPin edc:name="IOCA4" edc:ppsfunction="CHANGE_NOTIFICATION" ltx:memberofperipheral="GPIOA"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="MSSP_SPI_I2C" ltx:memberofperipheral="SERCOM0"/>
      <edc:VirtualPin edc:name="RA4" edc:ppsfunction="PORT_I_O" ltx:memberofperipheral="GPIOA"/>
      <edc:VirtualPin edc:name="RPA4" edc:ppsfunction="PPS" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="OUT" edc:ppsfunction="RTCC" ltx:memberofperipheral="RTC"/>
      <edc:VirtualPin edc:name="DGI_SSN" edc:ppsfunction="SPI" ltx:memberofperipheral="DGI_SPI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NMCLR"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="XO_N"/>
      <edc:VirtualPin edc:name="xo_n" edc:ppsfunction="RF__ANALOG" ltx:memberofperipheral="BTZBSYS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="XO_P"/>
      <edc:VirtualPin edc:name="xo_p" edc:ppsfunction="RF__ANALOG" ltx:memberofperipheral="BTZBSYS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD_PLL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="CLDO_OUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RFLDO_OUT" edc:ppsfunction="POWER_SUPPLY" ltx:memberofperipheral="BTZBSYS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="BUCK_CLDO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="BUCK_PA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RF_IO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB4"/>
      <edc:VirtualPin edc:name="AIN0" edc:ppsfunction="ADC" ltx:memberofperipheral="ADCHS"/>
      <edc:VirtualPin edc:name="CVD0" edc:ppsfunction="ADC" ltx:memberofperipheral="ADCHS"/>
      <edc:VirtualPin edc:name="CVDR0" edc:ppsfunction="ADC" ltx:memberofperipheral="CVD"/>
      <edc:VirtualPin edc:name="CVDT0" edc:ppsfunction="ADC" ltx:memberofperipheral="CVD"/>
      <edc:VirtualPin edc:name="IOCB4" edc:ppsfunction="CHANGE_NOTIFICATION" ltx:memberofperipheral="GPIOB"/>
      <edc:VirtualPin edc:name="RB4" edc:ppsfunction="PORT_I_O" ltx:memberofperipheral="GPIOB"/>
      <edc:VirtualPin edc:name="RPB4" edc:ppsfunction="PPS" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="TP4" edc:ppsfunction="RF__ANALOG" ltx:memberofperipheral="BTZBSYS"/>
      <edc:VirtualPin edc:name="FECTRL3" edc:ppsfunction="RF__DIGITAL" ltx:memberofperipheral="BTZBSYS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AVDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB5"/>
      <edc:VirtualPin edc:name="AIN1" edc:ppsfunction="ADC" ltx:memberofperipheral="ADCHS"/>
      <edc:VirtualPin edc:name="CVD1" edc:ppsfunction="ADC" ltx:memberofperipheral="ADCHS"/>
      <edc:VirtualPin edc:name="CVDR1" edc:ppsfunction="ADC" ltx:memberofperipheral="CVD"/>
      <edc:VirtualPin edc:name="CVDT1" edc:ppsfunction="ADC" ltx:memberofperipheral="CVD"/>
      <edc:VirtualPin edc:name="IOCB5" edc:ppsfunction="CHANGE_NOTIFICATION" ltx:memberofperipheral="GPIOB"/>
      <edc:VirtualPin edc:name="RB5" edc:ppsfunction="PORT_I_O" ltx:memberofperipheral="GPIOB"/>
      <edc:VirtualPin edc:name="RPB5" edc:ppsfunction="PPS" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="TP5" edc:ppsfunction="RF__ANALOG" ltx:memberofperipheral="BTZBSYS"/>
      <edc:VirtualPin edc:name="FECTRL4" edc:ppsfunction="RF__DIGITAL" ltx:memberofperipheral="BTZBSYS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB6"/>
      <edc:VirtualPin edc:name="AIN2" edc:ppsfunction="ADC" ltx:memberofperipheral="ADCHS"/>
      <edc:VirtualPin edc:name="CVD2" edc:ppsfunction="ADC" ltx:memberofperipheral="ADCHS"/>
      <edc:VirtualPin edc:name="CVDR2" edc:ppsfunction="ADC" ltx:memberofperipheral="CVD"/>
      <edc:VirtualPin edc:name="CVDT2" edc:ppsfunction="ADC" ltx:memberofperipheral="CVD"/>
      <edc:VirtualPin edc:name="IOCB6" edc:ppsfunction="CHANGE_NOTIFICATION" ltx:memberofperipheral="GPIOB"/>
      <edc:VirtualPin edc:name="RB6" edc:ppsfunction="PORT_I_O" ltx:memberofperipheral="GPIOB"/>
      <edc:VirtualPin edc:name="RPB6" edc:ppsfunction="PPS" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="FECTRL5" edc:ppsfunction="RF__DIGITAL" ltx:memberofperipheral="BTZBSYS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB7"/>
      <edc:VirtualPin edc:name="AIN3" edc:ppsfunction="ADC" ltx:memberofperipheral="ADCHS"/>
      <edc:VirtualPin edc:name="CVD3" edc:ppsfunction="ADC" ltx:memberofperipheral="ADCHS"/>
      <edc:VirtualPin edc:name="CVDR3" edc:ppsfunction="ADC" ltx:memberofperipheral="CVD"/>
      <edc:VirtualPin edc:name="CVDT3" edc:ppsfunction="ADC" ltx:memberofperipheral="CVD"/>
      <edc:VirtualPin edc:name="IOCB7" edc:ppsfunction="CHANGE_NOTIFICATION" ltx:memberofperipheral="GPIOB"/>
      <edc:VirtualPin edc:name="RB7" edc:ppsfunction="PORT_I_O" ltx:memberofperipheral="GPIOB"/>
      <edc:VirtualPin edc:name="RPB7" edc:ppsfunction="PPS" ltx:memberofperipheral="PPS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA3"/>
      <edc:VirtualPin edc:name="ANN0" edc:ppsfunction="ADC__DIFFERENTIAL_" ltx:memberofperipheral="ADCHS"/>
      <edc:VirtualPin edc:name="IOCA3" edc:ppsfunction="CHANGE_NOTIFICATION" ltx:memberofperipheral="GPIOA"/>
      <edc:VirtualPin edc:name="DACOUT" edc:ppsfunction="DAC" ltx:memberofperipheral="DAC_CTRL"/>
      <edc:VirtualPin edc:name="RA3" edc:ppsfunction="PORT_I_O" ltx:memberofperipheral="GPIOA"/>
      <edc:VirtualPin edc:name="RPA3" edc:ppsfunction="PPS" ltx:memberofperipheral="PPS"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="RTCC" ltx:memberofperipheral="RTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA11"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA12"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PMU_MLDO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VPMU_VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PMU_BK"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
